R.org
* Control Files
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:3F5D7D24-91F0-4CBD-A514-C9D0B9821BDA
:END:

** Configuration
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:091465F6-8E3F-4736-9BF0-A498785F5E1D
:END:

The goal here is to get R set up thoughtfully and quickly. The profile
and environ set it up correctly. Always remember this and run R using those
configuration files.

- Steps
  - Review and Run =.Rsetup.sh= prepare the OS for R and R for your configuration
  - Review =.Renviron= to verify it is what you expect
  - Review =.Rprofile= to recall how you set it up
  - Review and Source =Rinstall= to install required packages
    - Verify the lib path is in the home directory =.libPaths()=
    - When R starts, it won't find any of the required packages. It will
      complain a lot. That is OK. Just keep running the install script until
      it is happy: =source("~/.Rinstall.r")=. Then restart R and everything should
      be fine.
    - Run the installation script 3-5 times, each time
      - Check the version that is running
      - Go back and read the transcript and make sure that it looks right
        - Build warnings
        - Configuration errors
        - Mask warnings
        - Package notifications
          - For example
            #+BEGIN_EXAMPLE
data.table 1.9.6  For help type ?data.table or https://github.com/Rdatatable/data.table/wiki
The fastest way to learn (by data.table authors): https://www.datacamp.com/courses/data-analysis-the-data-table-way
            #+END_EXAMPLE
          - …
            #+BEGIN_EXAMPLE
Attaching package: ‘magrittr’

The following objects are masked from ‘package:testthat’:

    equals, is_less_than, not

            #+END_EXAMPLE
          - …
            #+BEGIN_EXAMPLE
------------------------------------------------------------------------------
data.table + dplyr code now lives in dtplyr.
Please library(dtplyr)!
------------------------------------------------------------------------------
            #+END_EXAMPLE
      - Eventually that script will fail, for example
        - there is no package called ‘devtools’
          - Called =install.packages("devtools")= manually
          - Install order error
      - After running it a couple of times, it is finished

*.Rsetup*
#+NAME: org_gcr_2017-05-12_mara_290AFF18-0B4B-4EA4-9DD6-5AF56F4D8666
#+begin_src sh :tangle .Rsetup.sh :comments no :tangle-mode (identity #o755)
⟪rsetup-defs⟫
#+end_src

*.Rprofile*
#+NAME: org_gcr_2017-05-12_mara_782A27E2-93A2-46E7-8486-5A8D7D7491B9
#+begin_src R :tangle .Rprofile :comments no
## -*- mode: R; -*-
⟪rprofile-def⟫
.First <- function() {
    gcr <- new.env()
    ⟪rfirst-defs⟫
    base::attach(gcr, name="gcr", warn.conflicts=FALSE)
}
fortune()
#+end_src

*.Renviron*
#+NAME: org_gcr_2017-05-12_mara_CDF69874-1145-4301-8322-A5D59BB37BD8
#+begin_src sh :tangle .Renviron :comments no
# -*- mode: sh; -*-
⟪renviron-def⟫
#+end_src

*.Rinstall*
#+NAME: org_gcr_2017-05-12_mara_B59C073C-5783-4812-966A-53FDF8F9BE5C
#+begin_src sh :tangle .Rinstall.r :comments no
⟪rinstall-def⟫
#+end_src

** .Rsetup
:PROPERTIES:
:header-args: :noweb-ref rsetup-defs
:ID:       org_gcr_2017-05-12_mara:898031D5-9930-420A-9DDD-2F5FA0AA6D63
:END:

Prepare the operating system to host R.

Recreate the packages directory.

#+NAME: org_gcr_2017-05-12_mara_5B7DB196-95F7-43D7-AF8A-081748C7A91E
#+BEGIN_SRC sh
rm -rf ~/.Rpackages
mkdir ~/.Rpackages
#+END_SRC

Symbolically link all of the control files.

#+NAME: org_gcr_2017-05-12_mara_9BFCAC2B-E570-4038-82FE-C7A4B1AB054C
#+BEGIN_SRC sh
rm ~/.Rprofile
ln -sfn ~/src/help/.Rprofile ~/.Rprofile
rm ~/.Renviron
ln -sfn ~/src/help/.Renviron ~/.Renviron
rm ~/.Rinstall.r
ln -sfn ~/src/help/.Rinstall.r ~/.Rinstall.r
#+END_SRC

