R.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-07-22 Sat 23:17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title></title>
<meta name="generator" content="Org mode">
<meta name="author" content="Grant Rettke">
</head>
<body>
<div id="content">
<div id="outline-container-org643f5d1" class="outline-2">
<h2 id="org643f5d1"><a id="org_gcr_2017-05-12_mara:3F5D7D24-91F0-4CBD-A514-C9D0B9821BDA"></a><span class="section-number-2">1</span> Control Files</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:3F5D7D24-91F0-4CBD-A514-C9D0B9821BDA
</pre>
</div>

<div id="outline-container-org59905e1" class="outline-3">
<h3 id="org59905e1"><a id="org_gcr_2017-05-12_mara:091465F6-8E3F-4736-9BF0-A498785F5E1D"></a><span class="section-number-3">1.1</span> Configuration</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:091465F6-8E3F-4736-9BF0-A498785F5E1D
</pre>

<p>
The goal here is to get R set up thoughtfully and quickly. The profile
and environ set it up correctly. Always remember this and run R using those
configuration files.
</p>

<ul class="org-ul">
<li>Steps
<ul class="org-ul">
<li>Review and Run <code>.Rsetup.sh</code> prepare the OS for R and R for your configuration</li>
<li>Review <code>.Renviron</code> to verify it is what you expect</li>
<li>Review <code>.Rprofile</code> to recall how you set it up</li>
<li>Review and Source <code>Rinstall</code> to install required packages
<ul class="org-ul">
<li>Verify the lib path is in the home directory <code>.libPaths()</code></li>
<li>When R starts, it won&rsquo;t find any of the required packages. It will
complain a lot. That is OK. Just keep running the install script until
it is happy: <code>source("~/.Rinstall.r")</code>. Then restart R and everything should
be fine.</li>
<li>Run the installation script 3-5 times, each time
<ul class="org-ul">
<li>Check the version that is running</li>
<li>Go back and read the transcript and make sure that it looks right
<ul class="org-ul">
<li>Build warnings</li>
<li>Configuration errors</li>
<li>Mask warnings</li>
<li>Package notifications
<ul class="org-ul">
<li><p>
For example
</p>
<pre class="example">
data.table 1.9.6  For help type ?data.table or https://github.com/Rdatatable/data.table/wiki
The fastest way to learn (by data.table authors): https://www.datacamp.com/courses/data-analysis-the-data-table-way
</pre></li>
<li><p>
…
</p>
<pre class="example">
Attaching package: ‘magrittr’

The following objects are masked from ‘package:testthat’:

    equals, is_less_than, not

</pre></li>
<li><p>
…
</p>
<pre class="example">
------------------------------------------------------------------------------
data.table + dplyr code now lives in dtplyr.
Please library(dtplyr)!
------------------------------------------------------------------------------
</pre></li>
</ul></li>
</ul></li>
<li>Eventually that script will fail, for example
<ul class="org-ul">
<li>there is no package called ‘devtools’
<ul class="org-ul">
<li>Called <code>install.packages("devtools")</code> manually</li>
<li>Install order error</li>
</ul></li>
</ul></li>
<li>After running it a couple of times, it is finished</li>
</ul></li>
</ul></li>
</ul></li>
</ul>

<p>
<b>.Rsetup</b>
</p>
<div class="org-src-container">
<pre class="src src-sh" id="orgfa8ebd1">&#171;rsetup-defs&#187;
</pre>
</div>

<p>
<b>.Rprofile</b>
</p>
<div class="org-src-container">
<pre class="src src-R" id="org27c30b8"><span class="org-comment-delimiter">## </span><span class="org-comment">-*- mode: R; -*-</span>
&#171;rprofile-def&#187;
<span class="org-function-name">.First</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>() {
    gcr <span class="org-constant">&lt;-</span> new.env()
    &#171;rfirst-defs&#187;
    base::<span class="org-constant">attach</span>(gcr, name=<span class="org-string">"gcr"</span>, warn.conflicts=<span class="org-type">FALSE</span>)
}
fortune()
</pre>
</div>

<p>
<b>.Renviron</b>
</p>
<div class="org-src-container">
<pre class="src src-sh" id="org363c3a5"><span class="org-comment-delimiter"># </span><span class="org-comment">-*- mode: sh; -*-</span>
&#171;renviron-def&#187;
</pre>
</div>

<p>
<b>.Rinstall</b>
</p>
<div class="org-src-container">
<pre class="src src-sh" id="orgf84c08a">&#171;rinstall-def&#187;
</pre>
</div>
</div>
</div>

<div id="outline-container-org784e610" class="outline-3">
<h3 id="org784e610"><a id="org_gcr_2017-05-12_mara:898031D5-9930-420A-9DDD-2F5FA0AA6D63"></a><span class="section-number-3">1.2</span> .Rsetup</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
header-args: :noweb-ref rsetup-defs
ID: org_gcr_2017-05-12_mara:898031D5-9930-420A-9DDD-2F5FA0AA6D63
</pre>

<p>
Prepare the operating system to host R.
</p>

<p>
Recreate the packages directory.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgc62920e">rm -rf ~/.Rpackages
mkdir ~/.Rpackages
</pre>
</div>

<p>
Symbolically link all of the control files.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org51a803a">rm ~/.Rprofile
ln -sfn ~/src/help/.Rprofile ~/.Rprofile
rm ~/.Renviron
ln -sfn ~/src/help/.Renviron ~/.Renviron
rm ~/.Rinstall.r
ln -sfn ~/src/help/.Rinstall.r ~/.Rinstall.r
</pre>
</div>
</div>
</div>
