R.org
** .Rprofile [fn:89a51cf1: https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile]
      :PROPERTIES:
      :header-args: :noweb-ref rprofile-def
      :ID:       org_gcr_2017-05-12_mara:F665989E-724D-4983-A8B1-29F566291722
      :END:

- When you install packages, R needs to know which repository it should use. If
  you don't tell it, then it will ask you every time. It is just doing its job.
  Make it easier for yourself and specify a repo for once and for all.
  - Via [fn:41269bb7: http://www.r-bloggers.com/installing-r-packages/]
  - Built-in docs explain that =local= should be used here
  - This could also be a one-liner: ~options("repos" = c(CRAN = "http://cran.r-project.org/"))~
#+NAME: org_gcr_2017-05-12_mara_2776C7D7-893F-4144-9CDA-BE36909E4262
#+begin_src R
local({
    r = getOption("repos")
    r["CRAN"] = "https://cran.r-project.org/"
    options(repos = r)
})
#+end_src

- By default, hitting enter in the =browser= will submit a =c= for "continue
  execution at the next statement"
  - It is too easy to hit enter when you didn't mean it
  - It just /feels/ imprecise
  - Never let this happen, disable that feature
#+NAME: org_gcr_2017-05-12_mara_DF9DC3F2-E1FA-494C-9F6A-8358E158FFCA
#+begin_src R
options(browserNLdisabled = TRUE)
#+end_src

Show timestamps to 3 sub-seconds:
#+NAME: org_gcr_2017-05-12_mara_87D900DF-7B80-4579-A6C9-1031890A8BA8
#+begin_src R
options("digits.secs"=3)
#+end_src

Do not allow automatic coercion of strings into factors, as you can specify this
by argument to make it /real/ obvious. Looks like the best way is to leave it
alone globally and always do it by hand though. hwickam commented that it is
bad, bad idea to make this option global not because of your code, but because
of everyone else's that you are using which relies on the option being set to
=TRUE=. Learning more about this, before this was an option, it was the default
behavior (being true) because statisticians rarely dealth with character
arrays. As the popularity of R skyrocketed, suddently people wanted to work
with them a lot. It isn't custom code that expects it to be true, rather, it
is library code that expects it to true. Definitely something that you don't
want to mess with.
#+NAME: org_gcr_2017-05-12_mara_D9A48141-CD6E-4BD5-8FB5-95AF5AB99F9C
#+begin_src R
options(stringsAsFactors=TRUE)
#+end_src

This might be /too much/, but always show a call stack when *any* warnings or
errors occur
#+NAME: org_gcr_2017-05-12_mara_2797E9CB-6074-432A-A716-7422A347FCD7
#+begin_src R
options(showWarnCalls=TRUE)
options(showErrorCalls=TRUE)
#+end_src

Be highly conservative about errors and warnings: handle the former immediately
and cause the latter to be errors. However, only do this after your workspace
has initialized correctly. Do so too soon and most things won't work because
this approach is only to handle /my/ issues. Imagine of the whole work just
handled their own issues! Anway, the safe values are set here, leave them alone.
Making them more aggressive will break your startup. When you are ready to set
things to be more aggressive, turn it on yourself
#+NAME: org_gcr_2017-05-12_mara_F9F57CE4-9446-40D8-8E00-06DF5C1B102C
#+begin_src R
options(error=NULL)
options(warn=0)
#+end_src

Don't print more than 500 lines. If you can grok more than 500 lines then please
teach me. Be at ease, there is a helper to remove that restriction, just in case.
#+NAME: org_gcr_2017-05-12_mara_88843855-5194-48BD-A295-9487FD44AFB8
#+begin_src R
options(max.print=500)
#+end_src

Partial matching is a neat and flexible feature for objects. In theory, it is
quite powerful and convenient. In practice it seems like a really bad idea to
me. It is a /personal preference/. It only makes sense from that perspective.
This could bork 3rd party code.
#+NAME: org_gcr_2017-05-12_mara_DA5994F4-E4B2-4AAF-ABA3-1894FA1BD6DA
#+begin_src R
options(warnPartialMatchDollar = TRUE)
#+end_src

Locale:
- Make sure that the language is set correctly. I couldn't find anything specific
  about setting it this way other than various posts. In practice you would really
  put all of this in your system environment configuration, but I'm wanting to be
  a little more particular here because it affects operations on data structures,
  in particular sorting.
- Error messages are mostly useful when they are displayed in English, so make
  sure that the locale is always English [fn:24499ef7:    http://cran.r-project.org/doc/manuals/r-patched/R-admin.html#Localization-of-messages].
  "Note that the LANGUAGE environment variable has precedence over ~LC_MESSAGES~ in
  selecting the language for message translation on most R platforms." [fn:51fe4215: http://stat.ethz.ch/R-manual/R-devel/library/base/html/locales.html]
- Note:
  - My previous approach was to define a top level binding for the locale string
    and pass that reference to bind each of the following settings. That was fine
    until I wanted to be able to easily clear out all of the top-level bindngs to
    "reset" it with a =rm(ls())= kind of thing. For that reason, I just use the
    manifest strings here.
#+NAME: org_gcr_2017-05-12_mara_2625A28E-D2FD-4239-B7F0-C44393AD5845
#+begin_src R
Sys.setenv(LANG = "en_US.UTF-8")
Sys.setlocale("LC_COLLATE", "en_US.UTF-8")
Sys.setlocale("LC_MESSAGES", "en_US.UTF-8")
#+end_src

Set the same random seed.

#+NAME: org_gcr_2017-05-12_mara_88DDEE7D-F188-4E1F-B42D-7B90ACE48F75
#+begin_src R
set.seed(970396220)
#+END_SRC

*** Packages
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:E5E7A597-B53A-476B-83A4-0B4114125E0C
:END:

<2014-11-14 Fri>
Below is a try to auto-install packages if they are not available, and, it seems
to have failed. Perhaps there is a better way, and I do need to find it. Until
then I will install as-needed. As such, I suppose that I've found it.

**** assertthat
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:404A7BC2-F0E1-4E49-8CCA-D693D3430741
:END:

Design-by-contract  [fn:bc0c6d68: http://cran.r-project.org/web/packages/assertthat/index.html
] is a great, great thing. Make it much easier with valuable
functions and useful messages!

Cheatsheet:
- Always use ~assert_that~
- Use
  - ℝ built ins to check tests
  - Additionally via =assertthat=:
    - =is.flag=
    - =is.string=
    - =has_name=
    - =has_attr=
    - =is.count=
    - =are_equal=
    - =not_empty=
    - =noNA=
    - =is.dir=
    - =is.writeable= and =is.readable=
    - =has_extension=

#+NAME: org_gcr_2017-05-12_mara_B7F431B3-C5EC-42FB-8C0B-63BEE51FE409
#+begin_src R
library(assertthat)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_2B97E549-76E0-4EBD-AC7B-68A9AF02D81B
#+begin_src R :noweb-ref rinstall-def
if(! require(assertthat)){
    install.packages("assertthat")
}
#+end_src

