R.html

<div id="outline-container-orgf2c86ec" class="outline-3">
<h3 id="orgf2c86ec"><a id="org_gcr_2017-05-12_mara:F665989E-724D-4983-A8B1-29F566291722"></a><span class="section-number-3">1.3</span> .Rprofile <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
header-args: :noweb-ref rprofile-def
ID: org_gcr_2017-05-12_mara:F665989E-724D-4983-A8B1-29F566291722
</pre>

<ul class="org-ul">
<li>When you install packages, R needs to know which repository it should use. If
you don&rsquo;t tell it, then it will ask you every time. It is just doing its job.
Make it easier for yourself and specify a repo for once and for all.
<ul class="org-ul">
<li>Via <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></li>
<li>Built-in docs explain that <code>local</code> should be used here</li>
<li>This could also be a one-liner: <code>options("repos" = c(CRAN = "http://cran.r-project.org/"))</code></li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-R" id="org6125d3f">local({
    r = getOption(<span class="org-string">"repos"</span>)
    r[<span class="org-string">"CRAN"</span>] = <span class="org-string">"https://cran.r-project.org/"</span>
    options(repos = r)
})
</pre>
</div>

<ul class="org-ul">
<li>By default, hitting enter in the <code>browser</code> will submit a <code>c</code> for &ldquo;continue
execution at the next statement&rdquo;
<ul class="org-ul">
<li>It is too easy to hit enter when you didn&rsquo;t mean it</li>
<li>It just <i>feels</i> imprecise</li>
<li>Never let this happen, disable that feature</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-R" id="org5da5d20">options(browserNLdisabled = <span class="org-type">TRUE</span>)
</pre>
</div>

<p>
Show timestamps to 3 sub-seconds:
</p>
<div class="org-src-container">
<pre class="src src-R" id="org0bf64c7">options(<span class="org-string">"digits.secs"</span>=3)
</pre>
</div>

<p>
Do not allow automatic coercion of strings into factors, as you can specify this
by argument to make it <i>real</i> obvious. Looks like the best way is to leave it
alone globally and always do it by hand though. hwickam commented that it is
bad, bad idea to make this option global not because of your code, but because
of everyone else&rsquo;s that you are using which relies on the option being set to
<code>TRUE</code>. Learning more about this, before this was an option, it was the default
behavior (being true) because statisticians rarely dealth with character
arrays. As the popularity of R skyrocketed, suddently people wanted to work
with them a lot. It isn&rsquo;t custom code that expects it to be true, rather, it
is library code that expects it to true. Definitely something that you don&rsquo;t
want to mess with.
</p>
<div class="org-src-container">
<pre class="src src-R" id="org9661312">options(stringsAsFactors=<span class="org-type">TRUE</span>)
</pre>
</div>

<p>
This might be <i>too much</i>, but always show a call stack when <b>any</b> warnings or
errors occur
</p>
<div class="org-src-container">
<pre class="src src-R" id="orgfb4b1ce">options(showWarnCalls=<span class="org-type">TRUE</span>)
options(showErrorCalls=<span class="org-type">TRUE</span>)
</pre>
</div>

<p>
Be highly conservative about errors and warnings: handle the former immediately
and cause the latter to be errors. However, only do this after your workspace
has initialized correctly. Do so too soon and most things won&rsquo;t work because
this approach is only to handle <i>my</i> issues. Imagine of the whole work just
handled their own issues! Anway, the safe values are set here, leave them alone.
Making them more aggressive will break your startup. When you are ready to set
things to be more aggressive, turn it on yourself
</p>
<div class="org-src-container">
<pre class="src src-R" id="orgaa32f17">options(error=<span class="org-type">NULL</span>)
options(warn=0)
</pre>
</div>

<p>
Don&rsquo;t print more than 500 lines. If you can grok more than 500 lines then please
teach me. Be at ease, there is a helper to remove that restriction, just in case.
</p>
<div class="org-src-container">
<pre class="src src-R" id="org330a9c4">options(max.print=500)
</pre>
</div>

<p>
Partial matching is a neat and flexible feature for objects. In theory, it is
quite powerful and convenient. In practice it seems like a really bad idea to
me. It is a <i>personal preference</i>. It only makes sense from that perspective.
This could bork 3rd party code.
</p>
<div class="org-src-container">
<pre class="src src-R" id="orgd37067b">options(warnPartialMatchDollar = <span class="org-type">TRUE</span>)
</pre>
</div>

<p>
Locale:
</p>
<ul class="org-ul">
<li>Make sure that the language is set correctly. I couldn&rsquo;t find anything specific
about setting it this way other than various posts. In practice you would really
put all of this in your system environment configuration, but I&rsquo;m wanting to be
a little more particular here because it affects operations on data structures,
in particular sorting.</li>
<li>Error messages are mostly useful when they are displayed in English, so make
sure that the locale is always English <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>.
&ldquo;Note that the LANGUAGE environment variable has precedence over <code>LC_MESSAGES</code> in
selecting the language for message translation on most R platforms.&rdquo; <sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></li>
<li>Note:
<ul class="org-ul">
<li>My previous approach was to define a top level binding for the locale string
and pass that reference to bind each of the following settings. That was fine
until I wanted to be able to easily clear out all of the top-level bindngs to
&ldquo;reset&rdquo; it with a <code>rm(ls())</code> kind of thing. For that reason, I just use the
manifest strings here.</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-R" id="org7ac2d57">Sys.setenv(LANG = <span class="org-string">"en_US.UTF-8"</span>)
Sys.setlocale(<span class="org-string">"LC_COLLATE"</span>, <span class="org-string">"en_US.UTF-8"</span>)
Sys.setlocale(<span class="org-string">"LC_MESSAGES"</span>, <span class="org-string">"en_US.UTF-8"</span>)
</pre>
</div>

<p>
Set the same random seed.
</p>

<div class="org-src-container">
<pre class="src src-R" id="orgdfdb682">set.seed(970396220)
</pre>
</div>
</div>

<div id="outline-container-orgc600afb" class="outline-4">
<h4 id="orgc600afb"><a id="org_gcr_2017-05-12_mara:E5E7A597-B53A-476B-83A4-0B4114125E0C"></a><span class="section-number-4">1.3.1</span> Packages</h4>
<div class="outline-text-4" id="text-1-3-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:E5E7A597-B53A-476B-83A4-0B4114125E0C
</pre>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2014-11-14 Fri&gt;</span></span>
Below is a try to auto-install packages if they are not available, and, it seems
to have failed. Perhaps there is a better way, and I do need to find it. Until
then I will install as-needed. As such, I suppose that I&rsquo;ve found it.
</p>
</div>

<ol class="org-ol"><li><a id="org24d51c0"></a><a id="org_gcr_2017-05-12_mara:404A7BC2-F0E1-4E49-8CCA-D693D3430741"></a>assertthat<br><div class="outline-text-5" id="text-1-3-1-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:404A7BC2-F0E1-4E49-8CCA-D693D3430741
</pre>

<p>
Design-by-contract  <sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup> is a great, great thing. Make it much easier with valuable
functions and useful messages!
</p>

<p>
Cheatsheet:
</p>
<ul class="org-ul">
<li>Always use <code>assert_that</code></li>
<li>Use
<ul class="org-ul">
<li>ℝ built ins to check tests</li>
<li>Additionally via <code>assertthat</code>:
<ul class="org-ul">
<li><code>is.flag</code></li>
<li><code>is.string</code></li>
<li><code>has_name</code></li>
<li><code>has_attr</code></li>
<li><code>is.count</code></li>
<li><code>are_equal</code></li>
<li><code>not_empty</code></li>
<li><code>noNA</code></li>
<li><code>is.dir</code></li>
<li><code>is.writeable</code> and <code>is.readable</code></li>
<li><code>has_extension</code></li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="org7a90d4e"><span class="org-constant">library</span>(assertthat)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgf438362"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(assertthat)){
    install.packages(<span class="org-string">"assertthat"</span>)
}
</pre>
</div>
</div></li>
