R.org
**** testthat
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:8B68967C-5F28-47AC-BD20-758661328199
:END:

Design-by-contract and unit-tests [fn:d61c81a6: http://cran.r-project.org/web/packages/testthat/index.html]
go hand-in-hand.

Expectations:
- =equals() :=: uses =all.equal()= to check for equality with numerical tolerance
  - Shorthand: =expect_equal(x, y)=
- =is_identical_to()= :: uses =identical()= to check for exact equality
  - Shorthand: =expect_identical(x, y)=
- =is_equivalent_to()= :: is a more relaxed version of =equals()= that ignores attributes
  - Shorthand: =expect_equivalent(x, y)=
- =is_a()= :: checks that an object =inherit()='s from a specified class
  - Shorthand: =expect_is(x, y)=
- =matches()= :: matches a character vector against a regular expression.
  - The optional all argument controls where all elements or just one element
    need to match.
  - Shorthand: =expect_matches(x, y)=
- =prints_text()= :: matches the printed output from an expression against a
  regular expression
  - Shorthand: =expect_output(x, y)=
- =shows_message()= :: checks that an expression shows a message
  - Shorthand: =expect_message(x, y)=
- =gives_warning()= :: expects that you get a warning
  - Shorthand: =expect_warning(x, y)=
- =throws_error()= :: verifies that the expression throws an error.
  - You can also supply a regular expression which is applied to the text of the
    error
  - Shorthand: =expect_error(x, y)=
- =is_true()= :: is a useful catchall if none of the other expectations do what
  you want - it checks that an expression is true
  - =is_false()= is the complement of =is_true()=
  - Shorthand: =expect_true(x)=
  - Shorthand: =expect_false(x)=

- Notes
  - "Each test is run in its own environment so it is self-contained."
    - Plain old code so you can modify the global environment FYI

#+NAME: org_gcr_2017-05-12_mara_BD9434A3-7ABA-47C9-8DF9-9D1333E88FFC
#+begin_src R
library(testthat)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_36895EED-30D0-4A93-95A8-B067FEF6426A
#+begin_src R :noweb-ref rinstall-def
if(! require(testthat)) {
    install.packages("testthat")
}
#+end_src

**** stringr
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:A25AE0EF-0169-4D2A-9907-D59FA7F0E9C4
:END:

Make it really easy to work with strings [fn:bb2c9d86: http://cran.r-project.org/web/packages/stringr/index.html]. That is indeed a good goal, and
the reason that I installed this initially was because =testthat= mentions that
it is used.
#+NAME: org_gcr_2017-05-12_mara_C048FA06-302D-4C4A-AAB1-65B4AE4A5F15
#+begin_src R
library(stringr)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_41A574C0-88B8-496F-831D-46D25A417D93
#+begin_src R :noweb-ref rinstall-def
if(! require(stringr)) {
    install.packages("stringr")
}
#+end_src

