R.html

<li><a id="org1c0c868"></a><a id="org_gcr_2017-05-12_mara:8B68967C-5F28-47AC-BD20-758661328199"></a>testthat<br><div class="outline-text-5" id="text-1-3-1-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:8B68967C-5F28-47AC-BD20-758661328199
</pre>

<p>
Design-by-contract and unit-tests <sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>
go hand-in-hand.
</p>

<p>
Expectations:
</p>
<ul class="org-ul">
<li><code>equals() :</code>: uses <code>all.equal()</code> to check for equality with numerical tolerance
<ul class="org-ul">
<li>Shorthand: <code>expect_equal(x, y)</code></li>
</ul></li>
<li id="<code>is_identical_to()</code>">uses <code>identical()</code> to check for exact equality
<ul class="org-ul">
<li>Shorthand: <code>expect_identical(x, y)</code></li>
</ul></li>
<li id="<code>is_equivalent_to()</code>">is a more relaxed version of <code>equals()</code> that ignores attributes
<ul class="org-ul">
<li>Shorthand: <code>expect_equivalent(x, y)</code></li>
</ul></li>
<li id="<code>is_a()</code>">checks that an object <code>inherit()</code>&rsquo;s from a specified class
<ul class="org-ul">
<li>Shorthand: <code>expect_is(x, y)</code></li>
</ul></li>
<li id="<code>matches()</code>">matches a character vector against a regular expression.
<ul class="org-ul">
<li>The optional all argument controls where all elements or just one element
need to match.</li>
<li>Shorthand: <code>expect_matches(x, y)</code></li>
</ul></li>
<li id="<code>prints_text()</code>">matches the printed output from an expression against a
regular expression
<ul class="org-ul">
<li>Shorthand: <code>expect_output(x, y)</code></li>
</ul></li>
<li id="<code>shows_message()</code>">checks that an expression shows a message
<ul class="org-ul">
<li>Shorthand: <code>expect_message(x, y)</code></li>
</ul></li>
<li id="<code>gives_warning()</code>">expects that you get a warning
<ul class="org-ul">
<li>Shorthand: <code>expect_warning(x, y)</code></li>
</ul></li>
<li id="<code>throws_error()</code>">verifies that the expression throws an error.
<ul class="org-ul">
<li>You can also supply a regular expression which is applied to the text of the
error</li>
<li>Shorthand: <code>expect_error(x, y)</code></li>
</ul></li>
<li id="<code>is_true()</code>">is a useful catchall if none of the other expectations do what
you want - it checks that an expression is true
<ul class="org-ul">
<li><code>is_false()</code> is the complement of <code>is_true()</code></li>
<li>Shorthand: <code>expect_true(x)</code></li>
<li>Shorthand: <code>expect_false(x)</code></li>
</ul></li>

<li>Notes
<ul class="org-ul">
<li>&ldquo;Each test is run in its own environment so it is self-contained.&rdquo;
<ul class="org-ul">
<li>Plain old code so you can modify the global environment FYI</li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="org1fc7220"><span class="org-constant">library</span>(testthat)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgafaf0e4"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(testthat)) {
    install.packages(<span class="org-string">"testthat"</span>)
}
</pre>
</div>
</div></li>

<li><a id="org7df09d5"></a><a id="org_gcr_2017-05-12_mara:A25AE0EF-0169-4D2A-9907-D59FA7F0E9C4"></a>stringr<br><div class="outline-text-5" id="text-1-3-1-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:A25AE0EF-0169-4D2A-9907-D59FA7F0E9C4
</pre>

<p>
Make it really easy to work with strings <sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup>. That is indeed a good goal, and
the reason that I installed this initially was because <code>testthat</code> mentions that
it is used.
</p>
<div class="org-src-container">
<pre class="src src-R" id="org5a290cd"><span class="org-constant">library</span>(stringr)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgf61fc35"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(stringr)) {
    install.packages(<span class="org-string">"stringr"</span>)
}
</pre>
</div>
</div></li>
