R.html

<li><a id="org7342bf3"></a><a id="org_gcr_2017-05-12_mara:D6EBC636-F22D-452F-B777-15F7C4C025A4"></a>sqldf<br><div class="outline-text-5" id="text-1-3-1-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D6EBC636-F22D-452F-B777-15F7C4C025A4
</pre>

<p>
How you extract data from a dataframe is flexible and everyone can and may do it
differently. One option available is to use <code>SQL</code> <sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup>, so make it available.
</p>

<p>
Comments taken from <sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup>
</p>
<ul class="org-ul">
<li>&ldquo;This [using SQL] is a skill that every analyst should possess&rdquo;</li>
<li>&ldquo;Being able to write SQL will save you time and provide you with a way of
getting repeatable results so that you don&rsquo;t have to focus on doing the
calculations all the time and worrying about errors in Excel&rdquo;</li>
<li>&ldquo;[instead] You can focus on the task of actually analyzing your data&rdquo;</li>
</ul>

<p>
Notes from the user manual <sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup>
</p>
<ul class="org-ul">
<li>Interesting package info
<ul class="org-ul">
<li>&ldquo;Title Perform SQL Selects on R Data Frames&rdquo;</li>
<li>&ldquo;Author G. Grothendieck &lt;ggrothendieck@gmail.com&gt;&rdquo;</li>
<li>&ldquo;Description Description: Manipulate R data frames using SQL.&rdquo;</li>
<li>&ldquo;Depends R (&gt;= 2.14.0), gsubfn (&gt;= 0.6), proto, RSQLite (&gt;= 0.8-0),RSQLite.extfuns&rdquo;</li>
</ul></li>
<li>Google group mentioned <sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup>, joined it</li>
<li>Official site mentioned and it has good docs</li>
<li>Seems to uses SQLLite</li>
<li><code>read.csv.sql</code>
<ul class="org-ul">
<li>&ldquo;Read a file into R filtering it with an sql statement. Only the filtered
portion is processed by R so that files larger than R can otherwise handle
can be accommodated.&rdquo;</li>
<li>Parms
<ul class="org-ul">
<li>Handles <code>http</code> and <code>ftp</code> <code>URLs</code></li>
<li><code>filter</code>
<ul class="org-ul">
<li>&ldquo;If specified, this should be a shell/batch command that the input file is
piped through. For read.csv2.sql it is by default the following on
non-Windows systems: tr , .. This translates all commas in the file to
dots.&rdquo;
<ul class="org-ul">
<li>Why is that specific example mentioned?</li>
</ul></li>
</ul></li>
<li><code>field.types</code>
<ul class="org-ul">
<li>State the SQLite types for the column names</li>
<li>Rarely needed</li>
</ul></li>
<li><code>dbname</code>
<ul class="org-ul">
<li>&ldquo;As in <code>sqldf</code> except that the default is <code>tempfile()</code>. Specifying <code>NULL</code> will
put the database in memory which may improve speed but will limit the size
of the database by the available memory.&rdquo;</li>
</ul></li>
</ul></li>
<li>Details
<ul class="org-ul">
<li>&ldquo;Reads the indicated file into an sql database creating the database if it
does not already exist. Then it applies the sql statement returning the
result as a data frame. If the database did not exist prior to this
statement it is removed.&rdquo;</li>
<li>&ldquo;Note that it uses facilities of SQLite to read the file which are
intended for speed and therefore not as flexible as in R. For example, it
does not recognize quoted fields as special but will regard the quotes as
part of the field. See the sqldf help for more information.&rdquo;</li>
<li>&ldquo;<code>read.csv2.sql</code> is like <code>read.csv.sql</code> except the default sep is &rdquo;;&ldquo; and the
default filter translates all commas in the file to decimal points (i.e.
to dots).&rdquo;</li>
</ul></li>
<li>Value
<ul class="org-ul">
<li>&ldquo;If the sql statement is a select statement then a data frame is returned.&rdquo;</li>
</ul></li>
</ul></li>
<li><code>sqldf</code>
<dl class="org-dl">
<dt>Description</dt><dd>SQL select on data frames</dd>
<dt>(no term)</dt><dd>Arguments
<ul class="org-ul">
<li>=stringsAsFactors does what you think</li>
<li><code>row.names</code> could be useful</li>
<li><code>envir</code> could make it safer</li>
<li><code>method</code> determines how to type the data from the database into a dataframe
<ul class="org-ul">
<li>Looks like a <b>powerhouse</b> feature</li>
<li>Could greatly simplify data brokering</li>
</ul></li>
<li><code>file.format</code>
<ul class="org-ul">
<li><code>eol</code> handling mentioned across platforms</li>
<li>Ran into this with the built-in reader</li>
</ul></li>
<li><code>dbname</code>
<ul class="org-ul">
<li>SQLite creates an in-memory database!</li>
</ul></li>
</ul></dd>
<dt>(no term)</dt><dd>Details
<ul class="org-ul">
<li>The typical action of sqldf is to</li>
<li id="create a database">in memory</li>
<li id="read in the data frames and files">used in the select statement. This is
done by scanning the select statement to see which words in the select
statement are of class &ldquo;data.frame&rdquo; or &ldquo;file&rdquo; in the parent frame, or the
specified environment if envir is used, and for each object found by
reading it into the database if it is a data frame. Note that this
heuristic usually reads in the wanted data frames and files but on
occasion may harmlessly reads in extra ones too.</li>
<li id="run the select statement">getting the result as a data frame</li>
<li id="assign the classes">of the returned data frame’s columns if
method = &ldquo;auto&rdquo;. This is done by checking all the column names in the
read-in data frames and if any are the same as a column output from the
data base then that column is coerced to the class of the column whose
name matched. If the class of the column is &ldquo;factor&rdquo; or &ldquo;ordered&rdquo; or if
the column is not matched then the column is returned as is. If
method = &ldquo;auto.factor&rdquo; then processing is similar except that &ldquo;factor&rdquo;
and &ldquo;ordered&rdquo; classes and their levels will be assigned as well. The
&ldquo;auto.factor&rdquo; heuristic is less reliable than the &ldquo;auto&rdquo; heuristic. If
method = &ldquo;raw&rdquo; then the classes are returned as is from the database.</li>
<li id="cleanup">If the database was created by sqldf then it is deleted;
otherwise, all tables that were created are dropped in order to leave the
database in the same state that it was before. The database connection is
terminated.</li>
<li id="Warning">Although sqldf is usually used with on-the-fly databases which
it automatically sets up and destroys if you wish to use it with existing
databases be sure to back up your database prior to using it since
incorrect operation could destroy the entire database.</li>
</ul></dd>
<dt>(no term)</dt><dd>Value
<ul class="org-ul">
<li>The result of the specified select statement is output as a data frame.</li>
<li>If a vector of sql statements is given as x then the result of the last
one is returned.</li>
<li>If the x and connection arguments are missing then it returns a new
connection and also places this connection in the option sqldf.connection.
<ul class="org-ul">
<li>Great to know that the connection is cached!</li>
</ul></li>
</ul></dd>
<dt>(no term)</dt><dd>Notes
<ul class="org-ul">
<li>Big FYI: Commas in columns will be parsed as column separators!
<ul class="org-ul">
<li>Recommends using <code>read.table</code> if this matter</li>
</ul></li>
</ul></dd>
<dt>(no term)</dt><dd>Examples
<ul class="org-ul">
<li>They all demonstrate how to do it in R and then again with SQL</li>
<li>Super helpful</li>
<li>You seem to be able to do everything that you would expect possible</li>
</ul></dd>
<dt>(no term)</dt><dd>Thoughts
<ul class="org-ul">
<li>Need to grok both R and SQL to use this safely</li>
<li>Using temp tables is kind of huge</li>
<li>Via <sup><a id="fnr.12" class="footref" href="#fn.12">12</a></sup>
<ul class="org-ul">
<li>Use <code>_</code> instead lf <code>.</code> in column names from a R call
<ul class="org-ul">
<li>Where is this in the documentation?</li>
</ul></li>
</ul></li>
</ul></dd>
</dl></li>
</ul>

<p>
Notes from the official site <sup><a id="fnr.13" class="footref" href="#fn.13">13</a></sup>
</p>
<ul class="org-ul">
<li>Opening
<ul class="org-ul">
<li>How it works
<ul class="org-ul">
<li>The user simply specifies an SQL statement</li>
<li>in R using data frame names in place of table names</li>
<li>and a database with appropriate table layouts/schema is automatically
created,</li>
<li>the data frames are automatically loaded into the database,</li>
<li>the specified SQL statement is performed,</li>
<li>the result is read back into R</li>
<li>and the database is deleted all automatically behind the scenes making the
database&rsquo;s existence transparent to the user who only specifies the SQL
statement.</li>
</ul></li>
<li>Supports
<ul class="org-ul">
<li>SQLite</li>
<li>H2</li>
<li>PostgreSQL</li>
<li>MySQL</li>
</ul></li>
<li>The FAQ mostly talks about SQLite</li>
</ul></li>
<li>Overview
<ul class="org-ul">
<li>with sqldf the user is freed from having to do the following, all of which
are automatically done:
<ul class="org-ul">
<li>database setup</li>
<li>writing the create table statement which defines each table</li>
<li>importing and exporting to and from the database</li>
<li>coercing of the returned columns to the appropriate class in common cases</li>
</ul></li>
<li>It an be used for
<ul class="org-ul">
<li>learning R if you know SQL</li>
<li>Doing it faster than R</li>
<li>Load portions of a really large file</li>
</ul></li>
</ul></li>
<li>Troubleshooting
<ul class="org-ul">
<li>Set the driver expicitly</li>
<li>&ldquo;error messages regarding a data frame that has a dot in its name. The dot
is an SQL operator. Either quote the name appropriately or change the name
of the data frame to one without a dot.&rdquo;</li>
</ul></li>
<li>FAQ
<ul class="org-ul">
<li>Column class conversion touched upon</li>
<li>Dots in names
<ul class="org-ul">
<li>Dots are SQL operators so can&rsquo;t use them
<ul class="org-ul">
<li>See <code>?SQL92Keywords</code></li>
</ul></li>
<li>For columns
<ul class="org-ul">
<li>Either use underscore</li>
<li>Or simply remove them</li>
</ul></li>
<li>For tables
<ul class="org-ul">
<li>Double quote the name</li>
</ul></li>
</ul></li>
<li>H2 supports date types, which seems quite helpful</li>
<li>Name a column ending with two underscores and a type and the library will
convert the type to R correctly
<ul class="org-ul">
<li>Mentioned in the docs</li>
</ul></li>
<li>SQL is case <b>insensitive</b>
<ul class="org-ul">
<li>Don&rsquo;t rely on casing to differentiate column names</li>
</ul></li>
<li>We may examine the in-memory database table structure</li>
<li>Be quite careful about CSV data that contains commas again as this lib
won&rsquo;t handle it</li>
<li>Good examples of cleaning data gettig int into a R friendly format</li>
<li>Be sure to specify numeric values as integers or doubles so you get expected
results from division</li>
</ul></li>
<li>Examples
<ul class="org-ul">
<li>Example 1. Ordering and Limiting</li>
<li>Example 2. Averaging and Grouping</li>
<li>Example 3. Nested Select</li>
<li>Example 4. Join</li>
<li>Example 5. Insert Variables
<ul class="org-ul">
<li>Hugely convenient</li>
</ul></li>
<li>Example 6. File Input</li>
<li>Example 7. Nested Select</li>
<li>Example 8. Specifying File Format</li>
<li>Example 9. Working with Databases</li>
<li>Example 10. Persistent Connections</li>
<li>Example 11. Between and Alternatives</li>
<li>Example 12. Combine two files in permanent database</li>
<li>Example 13. read.csv.sql and read.csv2.sql
<ul class="org-ul">
<li>Uses SQLite&rsquo;s import facility to create an in-memory database</li>
<li>Then it reads the results of the query into R</li>
<li>The import does not involve R so it can handle larger files than R can
assuming that the query results in a size that does fit</li>
</ul></li>
<li>Example 14. Use of spatialite library functions</li>
<li>Example 15. Use of RSQLite.extfuns library functions</li>
<li>Example 16. Moving Average</li>
</ul></li>
</ul>

<p>
SQLite, SQL As Understood By SQLite:
</p>
<ul class="org-ul">
<li><a href="https://www.sqlite.org/lang_corefunc.html">Core Functions</a></li>
<li><a href="https://www.sqlite.org/lang_aggfunc.html">Aggregate Functions</a></li>
<li><a href="https://www.sqlite.org/lang_datefunc.html">Date And Time Functions</a></li>
<li>These previous are all provided by <a href="http://cran.r-project.org/web/packages/RSQLite.extfuns/index.html">RSQLite.extfuns</a></li>
</ul>

<p>
<code>proto</code> wouldn&rsquo;t load, so first configure <code>sqldf</code> via <a href="https://stackoverflow.com/questions/17128260/r-stuck-in-loading-sqldf-package">this solution</a>.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org141c6b9">options(gsubfn.engine=<span class="org-string">"R"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org8011652"><span class="org-constant">library</span>(sqldf)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org3c10358"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(sqldf)) {
    install.packages(<span class="org-string">"sqldf"</span>)
}
</pre>
</div>
</div></li>
