R.org
**** MASS
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:A577D755-41C6-4E7E-9637-6118FCD5944B
:END:

"Functions and datasets to support Venables and Ripley, 'Modern Applied
Statistics with S' (4th edition, 2002)." Also, =sqldf= recommended it be
installed, so it is the right time. [fn:4d284c54: http://cran.r-project.org/web/packages/MASS/index.html]

#+NAME: org_gcr_2017-05-12_mara_AC4A011C-9933-4334-BDA6-AEA41F8BAAD0
#+begin_src R
library(MASS)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_D230D03A-F0C1-4002-B5F7-980FEEA00852
#+begin_src R :noweb-ref rinstall-def
if(! require(MASS)) {
    install.packages("MASS")
}
#+end_src

**** jsonlite
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:B2715DBA-4A80-4DB8-B3BD-C660302D3FB9
:END:

Make it easy to work with JSON [37138455: http://cran.r-project.org/web/packages/jsonlite/index.html].
Reading the vignette's, it does a lot more, for example =rbind.pages=.

#+NAME: org_gcr_2017-05-12_mara_81499C37-5163-4CE5-B2B3-3FB82FF5B30E
#+begin_src R
library(jsonlite)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_0D6D6DFE-C8BF-48C1-8F78-471F103162BE
#+begin_src R :noweb-ref rinstall-def
if(! require(jsonlite)) {
    install.packages("jsonlite")
}
#+end_src

**** dplyr
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:F2C4419D-59D8-423F-97A8-2C4ED2246186
:END:

dplyr: a grammar of data manipulation in R

The fact that I am loading both =plyr= and =dplyr= is something that I am
questioning. I do so because I learned them in that order, so left it that way.
However, this just results in *more* binding shadowing, and I am not sure of the
implications, and they are usually never good.

#+begin_quote
[[http://cran.r-project.org/web/packages/dplyr/index.html][A fast, consistent tool]] for working with data frame like objects, both in memory and out of memory.
#+end_quote

[[http://cran.r-project.org/web/packages/dplyr/README.html][Readme]]. [[http://cran.r-project.org/web/packages/dplyr/dplyr.pdf][Manual]]. [[http://cran.r-project.org/web/packages/dplyr/vignettes/introduction.html][Introduction to dplyr]].

#+NAME: org_gcr_2017-05-12_mara_BF403663-EA6F-4DEF-96D8-53460EC01901
#+begin_src R
library(dplyr)
#+end_src

**** data.table
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:1604B2A7-7110-45B5-BB29-C27BDE9F37C4
:END:

=data.table= [fn:de30b846: http://cran.r-project.org/web/packages/data.table/index.html ]
is quite nice.

#+NAME: org_gcr_2017-05-12_mara_4F1AA6B0-18CF-4D27-BEEE-22F3575641A4
#+begin_src R
library(data.table)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_90160989-EC0D-4BEC-AC7B-F28BDAD36759
#+begin_src R :noweb-ref rinstall-def
if(! require(data.table)) {
    install.packages("data.table")
}
#+end_src

***** dtplyr
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:169E4CE8-D5BE-48F7-A43F-E89CEE4C6211
:END:

#+NAME: org_gcr_2017-05-12_mara_83D232DA-8D97-4284-96DB-DADB9862F228
#+begin_src R
library(dtplyr)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_92F783DE-ADA4-413A-B06D-967AA93EB141
#+begin_src R :noweb-ref rinstall-def
if(! require(dplyr)) {
    install.packages("dplyr")
}
#+end_src

#+NAME: org_gcr_2017-05-12_mara_7EC8A890-B67D-444C-9B9D-025A7A844F42
#+begin_src R :noweb-ref rinstall-def
if(! require(dtplyr)) {
    install.packages("dtplyr")
}
#+end_src

**** XML
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:4F801FC6-2D93-495E-9B7A-5FE6C5A1003A
:END:

Make ℝ truly enterprise [fn:bf8a1f82: http://cran.r-project.org/web/packages/XML/index.html].

#+NAME: org_gcr_2017-05-12_mara_A7A52714-2EBB-4AC1-BEFE-5B03B90078A8
#+begin_src R
library(XML)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_262E11ED-2048-41D6-BFA4-1368DAE75DCC
#+begin_src R :noweb-ref rinstall-def
if(! require(XML)) {
    install.packages("XML")
}
#+end_src

**** devtools
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:6BC90505-4FF2-4DB0-8020-F5F8057BA984
:END:

=devtools=: Tools to make developing ℝ code easier

#+begin_quote
[[http://cran.r-project.org/web/packages/devtools/index.html][Collection of package development tools]]
#+end_quote

That is a bit too terse. Intro to the README follows

#+begin_quote
The aim of devtools is to make your life as a package developer easier by providing R functions that simplify many common tasks. R packages are actually really simple, and with the right tools it should be easier to use the package structure than not. Package development in R can feel intimidating, but devtools does every thing it can to make it as welcoming as possible. devtools comes with a small guarantee: if because of a bug in devtools a member of R-core gets angry with you, I will send you a handwritten apology note. Just forward me the email and your address, and I'll get a card in the mail.
#+end_quote

Excellent.

[[http://cran.r-project.org/web/packages/devtools/README.html][Readme]]. [[http://cran.r-project.org/web/packages/devtools/devtools.pdf][Manual]]. [[https://github.com/hadley/devtools][Github]].

At the very least, just /know of/ this package, as you will be installing it if
you want to us =tidyr=.

#+NAME: org_gcr_2017-05-12_mara_2B4AA89B-247C-46DD-A301-6344F0DBDD55
#+begin_src R
library(devtools)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_9B9089AF-61CE-4448-8A4D-F250FB5209C3
#+begin_src R :noweb-ref rinstall-def
if(! require(devtools)) {
    install.packages("devtools")
    devtools::install_github("hadley/devtools")
}

#+end_src

**** magrittr
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:E4F80968-F698-4B63-B3F8-745625D74C39
:END:

This is a add from the /most understated package definition/ of the year
department. =magrittr= [fn:73ee53da: http://cran.r-project.org/web/packages/magrittr/index.html]
is, much like every Scheme library ever, deceptively simple in its power and
ease of use that it provides.

#+NAME: org_gcr_2017-05-12_mara_0E618832-34E5-493A-AF7D-2CD2639E96AA
#+begin_src R
library(magrittr)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_BE75C93B-FA42-403F-AAC5-511B6830B77F
#+begin_src R :noweb-ref rinstall-def
if(! require(magrittr)) {
    devtools::install_github("smbache/magrittr")
}
#+end_src

