R.html

<li><a id="org487efbf"></a><a id="org_gcr_2017-05-12_mara:A577D755-41C6-4E7E-9637-6118FCD5944B"></a>MASS<br><div class="outline-text-5" id="text-1-3-1-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:A577D755-41C6-4E7E-9637-6118FCD5944B
</pre>

<p>
&ldquo;Functions and datasets to support Venables and Ripley, &lsquo;Modern Applied
Statistics with S&rsquo; (4th edition, 2002).&rdquo; Also, <code>sqldf</code> recommended it be
installed, so it is the right time. <sup><a id="fnr.14" class="footref" href="#fn.14">14</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-R" id="org54cd914"><span class="org-constant">library</span>(MASS)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orge709bc1"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(MASS)) {
    install.packages(<span class="org-string">"MASS"</span>)
}
</pre>
</div>
</div></li>

<li><a id="orgd221038"></a><a id="org_gcr_2017-05-12_mara:B2715DBA-4A80-4DB8-B3BD-C660302D3FB9"></a>jsonlite<br><div class="outline-text-5" id="text-1-3-1-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:B2715DBA-4A80-4DB8-B3BD-C660302D3FB9
</pre>

<p>
Make it easy to work with JSON [37138455: <a href="http://cran.r-project.org/web/packages/jsonlite/index.html">http://cran.r-project.org/web/packages/jsonlite/index.html</a>].
Reading the vignette&rsquo;s, it does a lot more, for example <code>rbind.pages</code>.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org9cf884b"><span class="org-constant">library</span>(jsonlite)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgf7eb46b"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(jsonlite)) {
    install.packages(<span class="org-string">"jsonlite"</span>)
}
</pre>
</div>
</div></li>

<li><a id="orgb7b039a"></a><a id="org_gcr_2017-05-12_mara:F2C4419D-59D8-423F-97A8-2C4ED2246186"></a>dplyr<br><div class="outline-text-5" id="text-1-3-1-7">
<pre class="example">
ID: org_gcr_2017-05-12_mara:F2C4419D-59D8-423F-97A8-2C4ED2246186
</pre>

<p>
dplyr: a grammar of data manipulation in R
</p>

<p>
The fact that I am loading both <code>plyr</code> and <code>dplyr</code> is something that I am
questioning. I do so because I learned them in that order, so left it that way.
However, this just results in <b>more</b> binding shadowing, and I am not sure of the
implications, and they are usually never good.
</p>

<blockquote>
<p>
<a href="http://cran.r-project.org/web/packages/dplyr/index.html">A fast, consistent tool</a> for working with data frame like objects, both in memory and out of memory.
</p>
</blockquote>

<p>
<a href="http://cran.r-project.org/web/packages/dplyr/README.html">Readme</a>. <a href="http://cran.r-project.org/web/packages/dplyr/dplyr.pdf">Manual</a>. <a href="http://cran.r-project.org/web/packages/dplyr/vignettes/introduction.html">Introduction to dplyr</a>.
</p>

<div class="org-src-container">
<pre class="src src-R" id="orga3c3090"><span class="org-constant">library</span>(dplyr)
</pre>
</div>
</div></li>

<li><a id="orgc073c2d"></a><a id="org_gcr_2017-05-12_mara:1604B2A7-7110-45B5-BB29-C27BDE9F37C4"></a>data.table<br><div class="outline-text-5" id="text-1-3-1-8">
<pre class="example">
ID: org_gcr_2017-05-12_mara:1604B2A7-7110-45B5-BB29-C27BDE9F37C4
</pre>

<p>
<code>data.table</code> <sup><a id="fnr.15" class="footref" href="#fn.15">15</a></sup>
is quite nice.
</p>

<div class="org-src-container">
<pre class="src src-R" id="orgac2e843"><span class="org-constant">library</span>(data.table)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgeb67370"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(data.table)) {
    install.packages(<span class="org-string">"data.table"</span>)
}
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="orgb70ecca"></a><a id="org_gcr_2017-05-12_mara:169E4CE8-D5BE-48F7-A43F-E89CEE4C6211"></a>dtplyr<br><div class="outline-text-6" id="text-1-3-1-8-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:169E4CE8-D5BE-48F7-A43F-E89CEE4C6211
</pre>

<div class="org-src-container">
<pre class="src src-R" id="orga2a43a0"><span class="org-constant">library</span>(dtplyr)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgab7d443"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(dplyr)) {
    install.packages(<span class="org-string">"dplyr"</span>)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org4b5b5df"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(dtplyr)) {
    install.packages(<span class="org-string">"dtplyr"</span>)
}
</pre>
</div>
</div></li></ol></li>

<li><a id="org3dad0cd"></a><a id="org_gcr_2017-05-12_mara:4F801FC6-2D93-495E-9B7A-5FE6C5A1003A"></a>XML<br><div class="outline-text-5" id="text-1-3-1-9">
<pre class="example">
ID: org_gcr_2017-05-12_mara:4F801FC6-2D93-495E-9B7A-5FE6C5A1003A
</pre>

<p>
Make ℝ truly enterprise <sup><a id="fnr.16" class="footref" href="#fn.16">16</a></sup>.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org1f517f6"><span class="org-constant">library</span>(XML)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org62c38e9"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(XML)) {
    install.packages(<span class="org-string">"XML"</span>)
}
</pre>
</div>
</div></li>

<li><a id="orgf9898d5"></a><a id="org_gcr_2017-05-12_mara:6BC90505-4FF2-4DB0-8020-F5F8057BA984"></a>devtools<br><div class="outline-text-5" id="text-1-3-1-10">
<pre class="example">
ID: org_gcr_2017-05-12_mara:6BC90505-4FF2-4DB0-8020-F5F8057BA984
</pre>

<p>
<code>devtools</code>: Tools to make developing ℝ code easier
</p>

<blockquote>
<p>
<a href="http://cran.r-project.org/web/packages/devtools/index.html">Collection of package development tools</a>
</p>
</blockquote>

<p>
That is a bit too terse. Intro to the README follows
</p>

<blockquote>
<p>
The aim of devtools is to make your life as a package developer easier by providing R functions that simplify many common tasks. R packages are actually really simple, and with the right tools it should be easier to use the package structure than not. Package development in R can feel intimidating, but devtools does every thing it can to make it as welcoming as possible. devtools comes with a small guarantee: if because of a bug in devtools a member of R-core gets angry with you, I will send you a handwritten apology note. Just forward me the email and your address, and I&rsquo;ll get a card in the mail.
</p>
</blockquote>

<p>
Excellent.
</p>

<p>
<a href="http://cran.r-project.org/web/packages/devtools/README.html">Readme</a>. <a href="http://cran.r-project.org/web/packages/devtools/devtools.pdf">Manual</a>. <a href="https://github.com/hadley/devtools">Github</a>.
</p>

<p>
At the very least, just <i>know of</i> this package, as you will be installing it if
you want to us <code>tidyr</code>.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org514e841"><span class="org-constant">library</span>(devtools)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org23fd32e"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(devtools)) {
    install.packages(<span class="org-string">"devtools"</span>)
    devtools::install_github(<span class="org-string">"hadley/devtools"</span>)
}

</pre>
</div>
</div></li>

<li><a id="org21a8bb4"></a><a id="org_gcr_2017-05-12_mara:E4F80968-F698-4B63-B3F8-745625D74C39"></a>magrittr<br><div class="outline-text-5" id="text-1-3-1-11">
<pre class="example">
ID: org_gcr_2017-05-12_mara:E4F80968-F698-4B63-B3F8-745625D74C39
</pre>

<p>
This is a add from the <i>most understated package definition</i> of the year
department. <code>magrittr</code> <sup><a id="fnr.17" class="footref" href="#fn.17">17</a></sup>
is, much like every Scheme library ever, deceptively simple in its power and
ease of use that it provides.
</p>

<div class="org-src-container">
<pre class="src src-R" id="orga2fa200"><span class="org-constant">library</span>(magrittr)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org74c3255"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(magrittr)) {
    devtools::install_github(<span class="org-string">"smbache/magrittr"</span>)
}
</pre>
</div>
</div></li>
