R.org
**** reshape2
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:68274778-C58F-43D2-92D3-EBD90025A8D0
:END:

=reshape2=: Flexibly reshape data: a reboot of the =reshape= package

#+begin_quote
Reshape lets you flexibly restructure and aggregate data using just two functions: melt and cast.
#+end_quote

[[http://cran.r-project.org/web/packages/reshape2/index.html][CRAN]]. [[http://cran.r-project.org/web/packages/reshape2/reshape2.pdf][Manual]]. [[https://github.com/hadley/reshape/blob/master/README.md][Github]].

This seems to be a defacto standard.

#+NAME: org_gcr_2017-05-12_mara_7DA54C1E-71A1-4843-99A9-FCE9866EE1A7
#+begin_src R
library(reshape2)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_5307205D-58F2-48B1-A876-C09C2C37EB6F
#+begin_src R :noweb-ref rinstall-def
if(! require(reshape2)) {
    install.packages("reshape2")
}
#+end_src

**** tidyr
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:5CE86E38-28A9-48F0-92F8-0874C7B89DEE
:END:

=tidyr=: Easily tidy data with spread and gather functions for ℝ

#+begin_quote
[[http://cran.r-project.org/web/packages/tidyr/index.html][tidyr]] is an evolution of reshape2. It's design specifically for data tidying (not general reshaping or aggregating) and works well with dplyr data pipelines.
#+end_quote

[[http://cran.r-project.org/web/packages/tidyr/README.html][Readme]]. [[http://cran.r-project.org/web/packages/tidyr/tidyr.pdf][Manual]]. [[https://github.com/hadley/tidyr][Github]].

Not on CRAN yet so install via

#+NAME: org_gcr_2017-05-12_mara_F9C761C3-1513-4BF4-99E9-05B225592D36
#+begin_src R
library(tidyr)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_5F0C0855-9BB8-4CC4-B05F-C7F654997BAC
#+begin_src R :noweb-ref rinstall-def
if(! require(tidyr)) {
    devtools::install_github("hadley/tidyr")
}

#+end_src

**** lubridate
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:7F0E1F05-B547-4E6A-AFBF-E9E9D3FF1059
:END:

lubridate: Make dealing with dates a little easier in ℝ

#+begin_quote
[[http://cran.r-project.org/web/packages/lubridate/index.html][Lubridate]] makes it easier to work with dates and times by providing functions to identify and parse date-time data, extract and modify components of a date-time (years, months, days, hours, minutes, and seconds), perform accurate math on date-times, handle time zones and Daylight Savings Time. Lubridate has a consistent, memorable syntax, that makes working with dates fun instead of frustrating.
#+end_quote

[[http://cran.r-project.org/web/packages/lubridate/lubridate.pdf][Manual]]. [[http://cran.r-project.org/web/packages/lubridate/vignettes/lubridate.html][Vignette]].

#+NAME: org_gcr_2017-05-12_mara_73EDACC9-C2BC-4648-B304-64E4CC6279E8
#+begin_src R
library(lubridate)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_13C5AEA5-C8E3-4697-8F05-C475FEB72AAC
#+begin_src R :noweb-ref rinstall-def
if(! require(lubridate)) {
    install.packages("lubridate")
}
#+end_src

Perhaps in some /time/ there will be a unified approach to time-management among
all programming languages.

**** testit
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:4D15CAB4-E41F-4329-ABD3-6352BB53211C
:END:

testit: A simple package for testing R packages

[[https://github.com/yihui/testit][GitHub]]. [[http://cran.rstudio.com/web/packages/testit/index.html][CRAN]]. [[http://cran.rstudio.com/web/packages/testit/testit.pdf][Manual]].

Gives you =assert= and =test_pkg=. Save characters.

#+NAME: org_gcr_2017-05-12_mara_1F82B124-3A21-481F-8407-2FCB8BAB9B0B
#+begin_src R
library(testit)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_7514A801-7BBF-4AC8-8A93-98EC0EF06507
#+begin_src R :noweb-ref rinstall-def
if(! require(testit)) {
    install.packages("testit")
}
#+end_src

**** markdown
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:A060E8EA-7F3C-4A33-8001-EE936782065A
:END:

- [[http://cran.r-project.org/web/packages/markdown/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/markdown/markdown.pdf][reference]]
  - [[http://cran.r-project.org/web/packages/markdown/vignettes/markdown-examples.html][vignettes: markdown-examples]]
  - [[http://cran.r-project.org/web/packages/markdown/vignettes/markdown-output.html][vignettes: markdown-output]]
- [[https://github.com/rstudio/markdown][GitHub]]

#+NAME: org_gcr_2017-05-12_mara_6F11689D-25AE-47BB-9150-8AAA0C646D6C
#+begin_src R
library(markdown)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_60BB724D-8AE3-497A-918C-9A44AB169740
#+begin_src R :noweb-ref rinstall-def
if(! require(markdown)) {
    install.packages("markdown")
}
#+end_src

#+begin_quote
This package is referred to as R Markdown v1 when combined with knitr. The primary output format is HTML. Now we have introduced R Markdown v2, which is based on Pandoc and knitr, and supports much more types of output formats.
#+end_quote

