R.html

<li><a id="org724ae98"></a><a id="org_gcr_2017-05-12_mara:68274778-C58F-43D2-92D3-EBD90025A8D0"></a>reshape2<br><div class="outline-text-5" id="text-1-3-1-12">
<pre class="example">
ID: org_gcr_2017-05-12_mara:68274778-C58F-43D2-92D3-EBD90025A8D0
</pre>

<p>
<code>reshape2</code>: Flexibly reshape data: a reboot of the <code>reshape</code> package
</p>

<blockquote>
<p>
Reshape lets you flexibly restructure and aggregate data using just two functions: melt and cast.
</p>
</blockquote>

<p>
<a href="http://cran.r-project.org/web/packages/reshape2/index.html">CRAN</a>. <a href="http://cran.r-project.org/web/packages/reshape2/reshape2.pdf">Manual</a>. <a href="https://github.com/hadley/reshape/blob/master/README.md">Github</a>.
</p>

<p>
This seems to be a defacto standard.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org501fbf6"><span class="org-constant">library</span>(reshape2)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orga2757f1"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(reshape2)) {
    install.packages(<span class="org-string">"reshape2"</span>)
}
</pre>
</div>
</div></li>

<li><a id="org0a1263b"></a><a id="org_gcr_2017-05-12_mara:5CE86E38-28A9-48F0-92F8-0874C7B89DEE"></a>tidyr<br><div class="outline-text-5" id="text-1-3-1-13">
<pre class="example">
ID: org_gcr_2017-05-12_mara:5CE86E38-28A9-48F0-92F8-0874C7B89DEE
</pre>

<p>
<code>tidyr</code>: Easily tidy data with spread and gather functions for ℝ
</p>

<blockquote>
<p>
<a href="http://cran.r-project.org/web/packages/tidyr/index.html">tidyr</a> is an evolution of reshape2. It&rsquo;s design specifically for data tidying (not general reshaping or aggregating) and works well with dplyr data pipelines.
</p>
</blockquote>

<p>
<a href="http://cran.r-project.org/web/packages/tidyr/README.html">Readme</a>. <a href="http://cran.r-project.org/web/packages/tidyr/tidyr.pdf">Manual</a>. <a href="https://github.com/hadley/tidyr">Github</a>.
</p>

<p>
Not on CRAN yet so install via
</p>

<div class="org-src-container">
<pre class="src src-R" id="org12fda9d"><span class="org-constant">library</span>(tidyr)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org6934298"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(tidyr)) {
    devtools::install_github(<span class="org-string">"hadley/tidyr"</span>)
}

</pre>
</div>
</div></li>

<li><a id="orge432528"></a><a id="org_gcr_2017-05-12_mara:7F0E1F05-B547-4E6A-AFBF-E9E9D3FF1059"></a>lubridate<br><div class="outline-text-5" id="text-1-3-1-14">
<pre class="example">
ID: org_gcr_2017-05-12_mara:7F0E1F05-B547-4E6A-AFBF-E9E9D3FF1059
</pre>

<p>
lubridate: Make dealing with dates a little easier in ℝ
</p>

<blockquote>
<p>
<a href="http://cran.r-project.org/web/packages/lubridate/index.html">Lubridate</a> makes it easier to work with dates and times by providing functions to identify and parse date-time data, extract and modify components of a date-time (years, months, days, hours, minutes, and seconds), perform accurate math on date-times, handle time zones and Daylight Savings Time. Lubridate has a consistent, memorable syntax, that makes working with dates fun instead of frustrating.
</p>
</blockquote>

<p>
<a href="http://cran.r-project.org/web/packages/lubridate/lubridate.pdf">Manual</a>. <a href="http://cran.r-project.org/web/packages/lubridate/vignettes/lubridate.html">Vignette</a>.
</p>

<div class="org-src-container">
<pre class="src src-R" id="orgc185d8a"><span class="org-constant">library</span>(lubridate)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgd6c211c"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(lubridate)) {
    install.packages(<span class="org-string">"lubridate"</span>)
}
</pre>
</div>

<p>
Perhaps in some <i>time</i> there will be a unified approach to time-management among
all programming languages.
</p>
</div></li>

<li><a id="org404b87f"></a><a id="org_gcr_2017-05-12_mara:4D15CAB4-E41F-4329-ABD3-6352BB53211C"></a>testit<br><div class="outline-text-5" id="text-1-3-1-15">
<pre class="example">
ID: org_gcr_2017-05-12_mara:4D15CAB4-E41F-4329-ABD3-6352BB53211C
</pre>

<p>
testit: A simple package for testing R packages
</p>

<p>
<a href="https://github.com/yihui/testit">GitHub</a>. <a href="http://cran.rstudio.com/web/packages/testit/index.html">CRAN</a>. <a href="http://cran.rstudio.com/web/packages/testit/testit.pdf">Manual</a>.
</p>

<p>
Gives you <code>assert</code> and <code>test_pkg</code>. Save characters.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org8a15ffd"><span class="org-constant">library</span>(testit)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org99dc145"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(testit)) {
    install.packages(<span class="org-string">"testit"</span>)
}
</pre>
</div>
</div></li>

<li><a id="org6bf6ddf"></a><a id="org_gcr_2017-05-12_mara:A060E8EA-7F3C-4A33-8001-EE936782065A"></a>markdown<br><div class="outline-text-5" id="text-1-3-1-16">
<pre class="example">
ID: org_gcr_2017-05-12_mara:A060E8EA-7F3C-4A33-8001-EE936782065A
</pre>

<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/markdown/index.html">CRAN</a>
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/markdown/markdown.pdf">reference</a></li>
<li><a href="http://cran.r-project.org/web/packages/markdown/vignettes/markdown-examples.html">vignettes: markdown-examples</a></li>
<li><a href="http://cran.r-project.org/web/packages/markdown/vignettes/markdown-output.html">vignettes: markdown-output</a></li>
</ul></li>
<li><a href="https://github.com/rstudio/markdown">GitHub</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="org11b5549"><span class="org-constant">library</span>(markdown)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org3b0f58b"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(markdown)) {
    install.packages(<span class="org-string">"markdown"</span>)
}
</pre>
</div>

<blockquote>
<p>
This package is referred to as R Markdown v1 when combined with knitr. The primary output format is HTML. Now we have introduced R Markdown v2, which is based on Pandoc and knitr, and supports much more types of output formats.
</p>
</blockquote>
</div></li>
