R.org
**** knitr
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:90B8880A-A32A-4761-A05A-164144AE93AF
:END:

knitr: A general-purpose package for dynamic report generation in R

Read the [[http://yihui.name/knitr/][home page]]. It has great resources.

Watched [[https://www.screenr.com/qcv8][the video]]. Very nice to see; comfortable and familiar. Need to set up
RStudio for it. Clearly a critical tool. Cites Knuth.

Features are amazingly understated. If you've worked with all of these tools,
you will appreciate the importance of the author's effort!

=Objects=, =Options=, =Hooks=, and =Patterns= … what is this, Emacs?

There are demo [[http://yihui.name/knitr/demos][links]]. There is a [[https://github.com/yihui/knitr-examples][project for examples]]. This [[http://yihui.name/knitr/demo/showcase/][showcase]] has links
to websites, book reviews, solutions, R packages, courses, workshops and
presentations, books, papers and reports, wrappers, and blog posts on =knitr=.

[[https://github.com/yihui/knitr][Here]] is the GitHub project. Read the motivations and see the hours and days and
weeks that you have had spared! Uses =testit=, so read up on that and added it.

Read the [[https://github.com/yihui/knitr/blob/master/FAQ.md][Frequently Asked Questions]]. Joined the [[https://groups.google.com/forum/#!forum/knitr][mailing list]]. =ess= supports it.
Sure that I can configure the custom prompt. Great =README=.

[[http://cran.r-project.org/web/packages/knitr/index.html][CRAN]] as expected. Much better summary eg HTML, Makrdown, reStructuredText, and
AsciiDoc are mentioned. Curious about the cacheing, and how I would do it in
=org=. Custom code to run before and after a hunk are another thoughtful touch one
would expect coming from =org=. Also support Python and shell. The LaTeX and LyX
support is also pretty neat. Same [[http://cran.r-project.org/web/packages/knitr/README.html][READM]]E. [[http://cran.r-project.org/web/packages/knitr/knitr.pdf][Reference]].

Somehow missed the [[http://cran.r-project.org/web/packages/knitr/vignettes/knitr-refcard.pdf][reference card]] initially.

[[http://yihui.name/knitr/demo/vignette/][How to build package vignettes with knitr]].

#+NAME: org_gcr_2017-05-12_mara_A5B64729-F8B4-429E-A24F-5DC0BFB7AA4E
#+begin_src R
library(knitr)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_E65DF403-D8F4-4B18-9AF2-EF07F891FCD9
#+begin_src R :noweb-ref rinstall-def
if(! require(knitr)) {
    install.packages("knitr")
}
#+end_src

**** fortunes
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:420C813F-A6C0-41C9-8F4A-042DD8C4D059
:END:

R Fortunes.

[[http://cran.r-project.org/web/packages/fortunes/index.html][CRAN]].

#+NAME: org_gcr_2017-05-12_mara_21A2B6D3-05FE-4161-B0B3-A2B1A5184EAF
#+begin_src R
library(fortunes)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_5C7E3B93-1ABC-497D-94C0-E854F3EB8C6A
#+begin_src R :noweb-ref rinstall-def
if(! require(fortunes)) {
    install.packages("fortunes")
}
#+end_src

**** ggplot2
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:2CB46933-90E6-4366-BA74-71D2B1A4DE8D
:END:

- [[http://cran.r-project.org/web/packages/ggplot2/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/ggplot2/ggplot2.pdf][reference]]
- [[https://github.com/hadley/ggplot2][Github]]
  - [[https://github.com/hadley/ggplot2/wiki][wiki]]
    - Lots of great resources
      - Whyu use it, how to support it, improvide i
      - Publications using it, around the web
      - FAQ, roadmap
    - Case studies
    - Tips and tricks
    - Enhancements
- [[https://groups.google.com/forum/#!forum/ggplot2][Mail list]]
- [[http://ggplot2.org/][Homepage]]
  - [[http://docs.ggplot2.org/current/][Documentation]]

#+NAME: org_gcr_2017-05-12_mara_8251EDAD-800D-4AA6-9CF6-6D72D6C28726
#+begin_src R
library(ggplot2)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_DC1E00FC-2565-45BB-919A-EE51E3B19008
#+begin_src R :noweb-ref rinstall-def
if(! require(ggplot2)) {
    install.packages("ggplot2")
}
#+end_src

**** tikzDevice
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:9CDF266B-9DE6-42A4-846E-212B11070D6F
:END:

- [[http://cran.r-project.org/web/packages/tikzDevice/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/tikzDevice/tikzDevice.pdf][reference]]
  - [[http://cran.r-project.org/web/packages/tikzDevice/vignettes/tikzDevice.pdf][vignettes: tikzDevice]]
- [[https://github.com/yihui/tikzDevice][GitHub]]

#+NAME: org_gcr_2017-05-12_mara_B0E027B5-57BF-4594-B3A6-FA430EB2E97E
#+begin_src R
library(tikzDevice)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_0FD2B191-249B-4694-9CD1-A173801B417B
#+begin_src R :noweb-ref rinstall-def
if(! require(tikzDevice)) {
    install.packages("tikzDevice")
}
#+end_src

**** ascii
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:1645490F-7DEB-4227-8EAA-FBB1EFC329A0
:END:

- [[http://cran.r-project.org/web/packages/ascii/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/ascii/ascii.pdf][reference]]
- [[https://github.com/eusebe/ascii/][GitHub]]

#+NAME: org_gcr_2017-05-12_mara_FDD3F939-1F60-4123-AFC5-FA34275A09E4
#+begin_src R
library(ascii)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_EC4BE76A-ACC9-4172-9D26-E3F1372416F7
#+begin_src R :noweb-ref rinstall-def
if(! require(ascii)) {
    install.packages("ascii")
}
#+end_src

Always display =org= representations; I'm assuming that it will be /the/ dominant
vehicle for analysis.

#+NAME: org_gcr_2017-05-12_mara_E51BCB45-90E5-46F3-AFE6-C4B60E93597C
#+begin_src R
options(asciiType="org")
#+end_src

**** xtable
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:6438AA32-0335-4527-91BC-A90404AB36DD
:END:

- [[http://cran.r-project.org/web/packages/xtable/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/xtable/xtable.pdf][reference]]
  - [[http://cran.r-project.org/web/packages/xtable/vignettes/margintable.pdf][vignettes: margintable]]
  - [[http://cran.r-project.org/web/packages/xtable/vignettes/xtableGallery.pdf][vignettes: xtableGallery]]
- [[http://xtable.r-forge.r-project.org/][R-Forge]]

#+NAME: org_gcr_2017-05-12_mara_EE352CD5-AE55-430D-BA0B-41A56A74B81F
#+begin_src R
library(xtable)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_174E2929-B8BC-4AE4-BEF2-338FAECC9330
#+begin_src R :noweb-ref rinstall-def
if(! require(xtable)) {
    install.packages("xtable")
}
#+end_src

