R.html

<li><a id="org659443a"></a><a id="org_gcr_2017-05-12_mara:90B8880A-A32A-4761-A05A-164144AE93AF"></a>knitr<br><div class="outline-text-5" id="text-1-3-1-17">
<pre class="example">
ID: org_gcr_2017-05-12_mara:90B8880A-A32A-4761-A05A-164144AE93AF
</pre>

<p>
knitr: A general-purpose package for dynamic report generation in R
</p>

<p>
Read the <a href="http://yihui.name/knitr/">home page</a>. It has great resources.
</p>

<p>
Watched <a href="https://www.screenr.com/qcv8">the video</a>. Very nice to see; comfortable and familiar. Need to set up
RStudio for it. Clearly a critical tool. Cites Knuth.
</p>

<p>
Features are amazingly understated. If you&rsquo;ve worked with all of these tools,
you will appreciate the importance of the author&rsquo;s effort!
</p>

<p>
<code>Objects</code>, <code>Options</code>, <code>Hooks</code>, and <code>Patterns</code> … what is this, Emacs?
</p>

<p>
There are demo <a href="http://yihui.name/knitr/demos">links</a>. There is a <a href="https://github.com/yihui/knitr-examples">project for examples</a>. This <a href="http://yihui.name/knitr/demo/showcase/">showcase</a> has links
to websites, book reviews, solutions, R packages, courses, workshops and
presentations, books, papers and reports, wrappers, and blog posts on <code>knitr</code>.
</p>

<p>
<a href="https://github.com/yihui/knitr">Here</a> is the GitHub project. Read the motivations and see the hours and days and
weeks that you have had spared! Uses <code>testit</code>, so read up on that and added it.
</p>

<p>
Read the <a href="https://github.com/yihui/knitr/blob/master/FAQ.md">Frequently Asked Questions</a>. Joined the <a href="https://groups.google.com/forum/#!forum/knitr">mailing list</a>. <code>ess</code> supports it.
Sure that I can configure the custom prompt. Great <code>README</code>.
</p>

<p>
<a href="http://cran.r-project.org/web/packages/knitr/index.html">CRAN</a> as expected. Much better summary eg HTML, Makrdown, reStructuredText, and
AsciiDoc are mentioned. Curious about the cacheing, and how I would do it in
<code>org</code>. Custom code to run before and after a hunk are another thoughtful touch one
would expect coming from <code>org</code>. Also support Python and shell. The LaTeX and LyX
support is also pretty neat. Same <a href="http://cran.r-project.org/web/packages/knitr/README.html">READM</a>E. <a href="http://cran.r-project.org/web/packages/knitr/knitr.pdf">Reference</a>.
</p>

<p>
Somehow missed the <a href="http://cran.r-project.org/web/packages/knitr/vignettes/knitr-refcard.pdf">reference card</a> initially.
</p>

<p>
<a href="http://yihui.name/knitr/demo/vignette/">How to build package vignettes with knitr</a>.
</p>

<div class="org-src-container">
<pre class="src src-R" id="orgdb8fd70"><span class="org-constant">library</span>(knitr)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org1564244"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(knitr)) {
    install.packages(<span class="org-string">"knitr"</span>)
}
</pre>
</div>
</div></li>

<li><a id="orgd437e2a"></a><a id="org_gcr_2017-05-12_mara:420C813F-A6C0-41C9-8F4A-042DD8C4D059"></a>fortunes<br><div class="outline-text-5" id="text-1-3-1-18">
<pre class="example">
ID: org_gcr_2017-05-12_mara:420C813F-A6C0-41C9-8F4A-042DD8C4D059
</pre>

<p>
R Fortunes.
</p>

<p>
<a href="http://cran.r-project.org/web/packages/fortunes/index.html">CRAN</a>.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org714f374"><span class="org-constant">library</span>(fortunes)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgf7af345"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(fortunes)) {
    install.packages(<span class="org-string">"fortunes"</span>)
}
</pre>
</div>
</div></li>

<li><a id="org3e90828"></a><a id="org_gcr_2017-05-12_mara:2CB46933-90E6-4366-BA74-71D2B1A4DE8D"></a>ggplot2<br><div class="outline-text-5" id="text-1-3-1-19">
<pre class="example">
ID: org_gcr_2017-05-12_mara:2CB46933-90E6-4366-BA74-71D2B1A4DE8D
</pre>

<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/ggplot2/index.html">CRAN</a>
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/ggplot2/ggplot2.pdf">reference</a></li>
</ul></li>
<li><a href="https://github.com/hadley/ggplot2">Github</a>
<ul class="org-ul">
<li><a href="https://github.com/hadley/ggplot2/wiki">wiki</a>
<ul class="org-ul">
<li>Lots of great resources
<ul class="org-ul">
<li>Whyu use it, how to support it, improvide i</li>
<li>Publications using it, around the web</li>
<li>FAQ, roadmap</li>
</ul></li>
<li>Case studies</li>
<li>Tips and tricks</li>
<li>Enhancements</li>
</ul></li>
</ul></li>
<li><a href="https://groups.google.com/forum/#!forum/ggplot2">Mail list</a></li>
<li><a href="http://ggplot2.org/">Homepage</a>
<ul class="org-ul">
<li><a href="http://docs.ggplot2.org/current/">Documentation</a></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="org2b411ab"><span class="org-constant">library</span>(ggplot2)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org45de6fb"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(ggplot2)) {
    install.packages(<span class="org-string">"ggplot2"</span>)
}
</pre>
</div>
</div></li>

<li><a id="org0894388"></a><a id="org_gcr_2017-05-12_mara:9CDF266B-9DE6-42A4-846E-212B11070D6F"></a>tikzDevice<br><div class="outline-text-5" id="text-1-3-1-20">
<pre class="example">
ID: org_gcr_2017-05-12_mara:9CDF266B-9DE6-42A4-846E-212B11070D6F
</pre>

<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/tikzDevice/index.html">CRAN</a>
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/tikzDevice/tikzDevice.pdf">reference</a></li>
<li><a href="http://cran.r-project.org/web/packages/tikzDevice/vignettes/tikzDevice.pdf">vignettes: tikzDevice</a></li>
</ul></li>
<li><a href="https://github.com/yihui/tikzDevice">GitHub</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="orgb167be9"><span class="org-constant">library</span>(tikzDevice)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org227512e"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(tikzDevice)) {
    install.packages(<span class="org-string">"tikzDevice"</span>)
}
</pre>
</div>
</div></li>

<li><a id="org728888d"></a><a id="org_gcr_2017-05-12_mara:1645490F-7DEB-4227-8EAA-FBB1EFC329A0"></a>ascii<br><div class="outline-text-5" id="text-1-3-1-21">
<pre class="example">
ID: org_gcr_2017-05-12_mara:1645490F-7DEB-4227-8EAA-FBB1EFC329A0
</pre>

<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/ascii/index.html">CRAN</a>
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/ascii/ascii.pdf">reference</a></li>
</ul></li>
<li><a href="https://github.com/eusebe/ascii/">GitHub</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="orga2f5001"><span class="org-constant">library</span>(ascii)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgaeb8516"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(ascii)) {
    install.packages(<span class="org-string">"ascii"</span>)
}
</pre>
</div>

<p>
Always display <code>org</code> representations; I&rsquo;m assuming that it will be <i>the</i> dominant
vehicle for analysis.
</p>

<div class="org-src-container">
<pre class="src src-R" id="orgca40ef1">options(asciiType=<span class="org-string">"org"</span>)
</pre>
</div>
</div></li>

<li><a id="org168cd91"></a><a id="org_gcr_2017-05-12_mara:6438AA32-0335-4527-91BC-A90404AB36DD"></a>xtable<br><div class="outline-text-5" id="text-1-3-1-22">
<pre class="example">
ID: org_gcr_2017-05-12_mara:6438AA32-0335-4527-91BC-A90404AB36DD
</pre>

<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/xtable/index.html">CRAN</a>
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/xtable/xtable.pdf">reference</a></li>
<li><a href="http://cran.r-project.org/web/packages/xtable/vignettes/margintable.pdf">vignettes: margintable</a></li>
<li><a href="http://cran.r-project.org/web/packages/xtable/vignettes/xtableGallery.pdf">vignettes: xtableGallery</a></li>
</ul></li>
<li><a href="http://xtable.r-forge.r-project.org/">R-Forge</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="org6675822"><span class="org-constant">library</span>(xtable)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org3db82ad"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(xtable)) {
    install.packages(<span class="org-string">"xtable"</span>)
}
</pre>
</div>
</div></li>
