R.org
**** Hmisc
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:F42F3746-7E10-478D-ACAE-125BE4A15D5C
:END:

- [[http://cran.r-project.org/web/packages/Hmisc/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/Hmisc/Hmisc.pdf][reference]]
- [[https://github.com/harrelfe/Hmisc][GitHub]]

#+NAME: org_gcr_2017-05-12_mara_71B207A8-9A27-41EB-A70C-E46009281865
#+begin_src R
library(Hmisc)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_ED5F41D6-717C-4C6C-ABD4-F9BE0BC9CAAE
#+begin_src R :noweb-ref rinstall-def
if(! require(Hmisc)) {
    install.packages("Hmisc")
}
#+end_src

**** log4r
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:C6F05623-CF1C-46D0-A911-2ABB014267AF
:END:

- [[http://cran.r-project.org/web/packages/log4r/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/log4r/log4r.pdf][reference]]
- [[https://github.com/johnmyleswhite/log4r][GitHub]]

#+NAME: org_gcr_2017-05-12_mara_082A541A-C479-4CAC-9F23-51A34BD7AF11
#+begin_src R
library(log4r)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_DB77D13B-83D4-4465-8F2F-82D9921A3EA0
#+begin_src R :noweb-ref rinstall-def
if(! require(log4r)) {
    install.packages("log4r")
}
#+end_src

**** boot
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:1EC5636D-D340-4F00-BBEF-579000725366
:END:

- [[http://cran.r-project.org/web/packages/boot/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/boot/boot.pdf][reference]]

#+NAME: org_gcr_2017-05-12_mara_6A9C1011-0E52-4729-A15E-BDA3DE01D7C9
#+begin_src R
library(boot)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_DD3E0FE3-59A3-449A-8C1D-D821A205545D
#+begin_src R :noweb-ref rinstall-def
if(! require(boot)) {
    install.packages("boot")
}
#+end_src

**** kernlab
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:1860ABE6-06F1-449C-A5E4-EBCDEE4B8EB8
:END:

- [[http://cran.r-project.org/web/packages/kernlab/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/kernlab/kernlab.pdf][reference]]
  - [[http://cran.r-project.org/web/packages/kernlab/vignettes/kernlab.pdf][vignettes: kernlab]]
- GitHub

#+NAME: org_gcr_2017-05-12_mara_04200AA3-C30B-410B-A9A1-C89DA77A633B
#+begin_src R
library(kernlab)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_9A4FE214-1F39-4CCD-97FC-3C6EDA6439D0
#+begin_src R :noweb-ref rinstall-def
if(! require(kernlab)) {
    install.packages("kernlab")
}
#+end_src

**** R Utils
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:5AAB5490-A3D4-42E1-9630-15E9CE8A6D63
:END:

Programatically extract BZ2 files. Helpful for making decompression a
separarate task from loading.

#+NAME: org_gcr_2017-05-12_mara_885D2413-5670-4318-8427-B811AAAB2489
#+begin_src R
library(R.utils)
#+end_src

#+NAME: org_gcr_2017-05-12_mara_50B4B233-C2AD-45AB-B342-E4F6F2CAD200
#+begin_src R :noweb-ref rinstall-def
if(! require(R.utils)) {
    install.packages("R.utils")
}
#+end_src

