R.html

<li><a id="org9650169"></a><a id="org_gcr_2017-05-12_mara:F42F3746-7E10-478D-ACAE-125BE4A15D5C"></a>Hmisc<br><div class="outline-text-5" id="text-1-3-1-23">
<pre class="example">
ID: org_gcr_2017-05-12_mara:F42F3746-7E10-478D-ACAE-125BE4A15D5C
</pre>

<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/Hmisc/index.html">CRAN</a>
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/Hmisc/Hmisc.pdf">reference</a></li>
</ul></li>
<li><a href="https://github.com/harrelfe/Hmisc">GitHub</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="orge7bd469"><span class="org-constant">library</span>(Hmisc)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org18a0db8"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(Hmisc)) {
    install.packages(<span class="org-string">"Hmisc"</span>)
}
</pre>
</div>
</div></li>

<li><a id="orga50a7a6"></a><a id="org_gcr_2017-05-12_mara:C6F05623-CF1C-46D0-A911-2ABB014267AF"></a>log4r<br><div class="outline-text-5" id="text-1-3-1-24">
<pre class="example">
ID: org_gcr_2017-05-12_mara:C6F05623-CF1C-46D0-A911-2ABB014267AF
</pre>

<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/log4r/index.html">CRAN</a>
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/log4r/log4r.pdf">reference</a></li>
</ul></li>
<li><a href="https://github.com/johnmyleswhite/log4r">GitHub</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="org90f5346"><span class="org-constant">library</span>(log4r)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgfac820c"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(log4r)) {
    install.packages(<span class="org-string">"log4r"</span>)
}
</pre>
</div>
</div></li>

<li><a id="orgaba2bca"></a><a id="org_gcr_2017-05-12_mara:1EC5636D-D340-4F00-BBEF-579000725366"></a>boot<br><div class="outline-text-5" id="text-1-3-1-25">
<pre class="example">
ID: org_gcr_2017-05-12_mara:1EC5636D-D340-4F00-BBEF-579000725366
</pre>

<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/boot/index.html">CRAN</a>
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/boot/boot.pdf">reference</a></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="org4dc7ab9"><span class="org-constant">library</span>(boot)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org3f9ad92"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(boot)) {
    install.packages(<span class="org-string">"boot"</span>)
}
</pre>
</div>
</div></li>

<li><a id="org8225ce6"></a><a id="org_gcr_2017-05-12_mara:1860ABE6-06F1-449C-A5E4-EBCDEE4B8EB8"></a>kernlab<br><div class="outline-text-5" id="text-1-3-1-26">
<pre class="example">
ID: org_gcr_2017-05-12_mara:1860ABE6-06F1-449C-A5E4-EBCDEE4B8EB8
</pre>

<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/kernlab/index.html">CRAN</a>
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/kernlab/kernlab.pdf">reference</a></li>
<li><a href="http://cran.r-project.org/web/packages/kernlab/vignettes/kernlab.pdf">vignettes: kernlab</a></li>
</ul></li>
<li>GitHub</li>
</ul>

<div class="org-src-container">
<pre class="src src-R" id="org23bbe3c"><span class="org-constant">library</span>(kernlab)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgda6d239"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(kernlab)) {
    install.packages(<span class="org-string">"kernlab"</span>)
}
</pre>
</div>
</div></li>

<li><a id="org4b564e6"></a><a id="org_gcr_2017-05-12_mara:5AAB5490-A3D4-42E1-9630-15E9CE8A6D63"></a>R Utils<br><div class="outline-text-5" id="text-1-3-1-27">
<pre class="example">
ID: org_gcr_2017-05-12_mara:5AAB5490-A3D4-42E1-9630-15E9CE8A6D63
</pre>

<p>
Programatically extract BZ2 files. Helpful for making decompression a
separarate task from loading.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org3ca2bd9"><span class="org-constant">library</span>(R.utils)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org907ee1a"><span class="org-keyword">if</span>(! <span class="org-constant">require</span>(R.utils)) {
    install.packages(<span class="org-string">"R.utils"</span>)
}
</pre>
</div>
</div></li>
