R.org
**** Not explicitly loaded, but interesting packages
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:62914096-7336-4480-B8E4-950E2A553AA8
:END:

- [[http://projecttemplate.net/index.html][ProjectTemplate]]
- [[http://cran.r-project.org/web/packages/evaluate/index.html][evaluate]].utils
- [[http://cran.r-project.org/web/packages/yaml/index.html][yaml]]
- [[http://cran.r-project.org/web/packages/whisker/index.html][whisker]]
- [[http://cran.r-project.org/web/packages/formatR/index.html][formatR]]
- General caching [fn:452e6ab4: https://stackoverflow.com/questions/7262485/options-for-caching-memoization-hashing-in-r]
- [[http://cran.r-project.org/web/packages/stringi/index.html][stringi]]
  - [[http://www.r-bloggers.com/faster-easier-and-more-reliable-character-string-processing-with-stringi-0-3-1/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
  - Seems focused on Unicode details
  - Why this instead of =stringr=?
- [[http://cran.r-project.org/web/packages/futile.options/index.html][futile.options: Futile options management]]
  - Referenced by the =settings= article
- [[http://cran.r-project.org/web/packages/settings/][settings: Software Option Settings Manager for R]]
  - [[http://www.r-bloggers.com/easy-to-use-option-settings-management-with-the-settings-package/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/craigcitro/r-travis][r-travis]]
  - [[http://www.r-bloggers.com/travis-ci-to-github-pages/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/MangoTheCat/testCoverage][testCoverage]]
  - [[http://www.r-statistics.com/2014/11/analyzing-coverage-of-r-unit-tests-in-packages-the-testcoverage-package/][Via]]
- [[http://cran.r-project.org/web/packages/xkcd/index.html][xkcd]]
  - [[http://www.exegetic.biz/blog/2014/11/creating-more-effective-graphs/?utm_source%3Drss&utm_medium%3Drss&utm_campaign%3Dcreating-more-effective-graphs][Via]]
- [[https://github.com/EconometricsBySimulation/Ninja/blob/master/2014/11/circ.graph.R][circ.graph.R]]
  - [[http://www.r-bloggers.com/make-your-own-hotly-criticised-circle-graph/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/yhat/pandasql][pandasql]]
  - [[http://www.r-bloggers.com/query-pandas-dataframe-with-sql/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/qdap/index.html][qdap: Bridging the Gap Between Qualitative Data and Quantitative Analysis]]
  - Glad to find this
  - [[http://www.r-bloggers.com/exploration-of-letter-make-up-of-english-words/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/environmentalinformatics-marburg/Rsenal][Rsenal]]
  - [[http://www.r-bloggers.com/introducing-rsenal-magic-r-functions-for-things-various/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
  - Wished I had this the ohther day
- [[https://rapporter.github.io/pander/][pander]]
  - [[http://www.r-bloggers.com/pander-0-5-0-the-next-generation-of-markdown-tables-in-r/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://deployr.revolutionanalytics.com/][DeployR]]
  - [[http://www.r-bloggers.com/integrate-r-into-applications-with-deployr-open/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/openssl/][openssl: Bindings to OpenSSL]]
  - [[http://www.r-bloggers.com/generating-secure-random-numbers-with-openssl/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/Bart6114/simmer][simmer]]
  - Again I would have had to have written this myself
  - [[http://www.r-bloggers.com/simmer-2-0-a-performance-boost-revised-syntax/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/checkpoint/index.html][checkpoint: Install Packages from Snapshots on the Checkpoint Server for Reproducibility]]
  - [[http://www.r-bloggers.com/introducing-the-reproducible-r-toolkit-and-the-checkpoint-package/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/miniCRAN/index.html][miniCRAN: Tools to create an internally consistent, mini version of CRAN with selected packages only]]
  - [[http://www.r-bloggers.com/introducing-minicran-an-r-package-to-create-a-private-cran-repository/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://reaktanz.de/?c%3Dhacking&s%3DroxyPackage][roxyPackage]]
  - [[http://www.r-bloggers.com/managing-r-package-dependencies/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/roxygen2/index.html][roxygen2: In-source documentation for R]]
  - =roxypackage= mentioend it
- [[http://cran.r-project.org/web/packages/archivist/index.html][archivist: Tools for storing, restoring and searching for R objects]]
  - [[http://www.r-bloggers.com/lazy-load-with-archivist/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://dirk.eddelbuettel.com/code/pkgkitten.html][pkgKitten]]
  - [[http://www.r-bloggers.com/pkgkitten-0-1-1-still-creating-r-packages-that-purr/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://ramnathv.github.io/rCharts/][rCharts]]
  - [[http://www.r-bloggers.com/interactive-visualizations-from-r-using-rcharts/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/dgrtwo/broom][broom: Convert statistical analysis objects from R into tidy format]]
  - [[http://www.r-bloggers.com/r-package-to-convert-statistical-analysis-objects-to-tidy-data-frames/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://mran.revolutionanalytics.com/packages/info/?igraph][igraph: Network analysis and visualization]]
  - Why did they link to MRAN?
  - Looks like a great tool for learning about graphcs
  - [[http://www.r-bloggers.com/a-look-at-the-igraph-package/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%253A+RBloggers+%2528R+bloggers%2529][Via]]

