R.html

<li><a id="orgfe66176"></a><a id="org_gcr_2017-05-12_mara:62914096-7336-4480-B8E4-950E2A553AA8"></a>Not explicitly loaded, but interesting packages<br><div class="outline-text-5" id="text-1-3-1-28">
<pre class="example">
ID: org_gcr_2017-05-12_mara:62914096-7336-4480-B8E4-950E2A553AA8
</pre>

<ul class="org-ul">
<li><a href="http://projecttemplate.net/index.html">ProjectTemplate</a></li>
<li><a href="http://cran.r-project.org/web/packages/evaluate/index.html">evaluate</a>.utils</li>
<li><a href="http://cran.r-project.org/web/packages/yaml/index.html">yaml</a></li>
<li><a href="http://cran.r-project.org/web/packages/whisker/index.html">whisker</a></li>
<li><a href="http://cran.r-project.org/web/packages/formatR/index.html">formatR</a></li>
<li>General caching <sup><a id="fnr.18" class="footref" href="#fn.18">18</a></sup></li>
<li><a href="http://cran.r-project.org/web/packages/stringi/index.html">stringi</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/faster-easier-and-more-reliable-character-string-processing-with-stringi-0-3-1/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
<li>Seems focused on Unicode details</li>
<li>Why this instead of <code>stringr</code>?</li>
</ul></li>
<li><a href="http://cran.r-project.org/web/packages/futile.options/index.html">futile.options: Futile options management</a>
<ul class="org-ul">
<li>Referenced by the <code>settings</code> article</li>
</ul></li>
<li><a href="http://cran.r-project.org/web/packages/settings/">settings: Software Option Settings Manager for R</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/easy-to-use-option-settings-management-with-the-settings-package/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="https://github.com/craigcitro/r-travis">r-travis</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/travis-ci-to-github-pages/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="https://github.com/MangoTheCat/testCoverage">testCoverage</a>
<ul class="org-ul">
<li><a href="http://www.r-statistics.com/2014/11/analyzing-coverage-of-r-unit-tests-in-packages-the-testcoverage-package/">Via</a></li>
</ul></li>
<li><a href="http://cran.r-project.org/web/packages/xkcd/index.html">xkcd</a>
<ul class="org-ul">
<li><a href="http://www.exegetic.biz/blog/2014/11/creating-more-effective-graphs/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=creating-more-effective-graphs">Via</a></li>
</ul></li>
<li><a href="https://github.com/EconometricsBySimulation/Ninja/blob/master/2014/11/circ.graph.R">circ.graph.R</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/make-your-own-hotly-criticised-circle-graph/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="https://github.com/yhat/pandasql">pandasql</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/query-pandas-dataframe-with-sql/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="http://cran.r-project.org/web/packages/qdap/index.html">qdap: Bridging the Gap Between Qualitative Data and Quantitative Analysis</a>
<ul class="org-ul">
<li>Glad to find this</li>
<li><a href="http://www.r-bloggers.com/exploration-of-letter-make-up-of-english-words/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="https://github.com/environmentalinformatics-marburg/Rsenal">Rsenal</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/introducing-rsenal-magic-r-functions-for-things-various/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
<li>Wished I had this the ohther day</li>
</ul></li>
<li><a href="https://rapporter.github.io/pander/">pander</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/pander-0-5-0-the-next-generation-of-markdown-tables-in-r/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="http://deployr.revolutionanalytics.com/">DeployR</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/integrate-r-into-applications-with-deployr-open/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="http://cran.r-project.org/web/packages/openssl/">openssl: Bindings to OpenSSL</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/generating-secure-random-numbers-with-openssl/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="https://github.com/Bart6114/simmer">simmer</a>
<ul class="org-ul">
<li>Again I would have had to have written this myself</li>
<li><a href="http://www.r-bloggers.com/simmer-2-0-a-performance-boost-revised-syntax/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="http://cran.r-project.org/web/packages/checkpoint/index.html">checkpoint: Install Packages from Snapshots on the Checkpoint Server for Reproducibility</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/introducing-the-reproducible-r-toolkit-and-the-checkpoint-package/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="http://cran.r-project.org/web/packages/miniCRAN/index.html">miniCRAN: Tools to create an internally consistent, mini version of CRAN with selected packages only</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/introducing-minicran-an-r-package-to-create-a-private-cran-repository/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="http://reaktanz.de/?c=hacking&amp;s=roxyPackage">roxyPackage</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/managing-r-package-dependencies/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="http://cran.r-project.org/web/packages/roxygen2/index.html">roxygen2: In-source documentation for R</a>
<ul class="org-ul">
<li><code>roxypackage</code> mentioend it</li>
</ul></li>
<li><a href="http://cran.r-project.org/web/packages/archivist/index.html">archivist: Tools for storing, restoring and searching for R objects</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/lazy-load-with-archivist/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="http://dirk.eddelbuettel.com/code/pkgkitten.html">pkgKitten</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/pkgkitten-0-1-1-still-creating-r-packages-that-purr/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="https://ramnathv.github.io/rCharts/">rCharts</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/interactive-visualizations-from-r-using-rcharts/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="https://github.com/dgrtwo/broom">broom: Convert statistical analysis objects from R into tidy format</a>
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/r-package-to-convert-statistical-analysis-objects-to-tidy-data-frames/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
<li><a href="http://mran.revolutionanalytics.com/packages/info/?igraph">igraph: Network analysis and visualization</a>
<ul class="org-ul">
<li>Why did they link to MRAN?</li>
<li>Looks like a great tool for learning about graphcs</li>
<li><a href="http://www.r-bloggers.com/a-look-at-the-igraph-package/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+RBloggers+%28R+bloggers%29">Via</a></li>
</ul></li>
</ul>
</div></li></ol>
</div>
</div>
