R.org
** .First
      :PROPERTIES:
      :header-args: :noweb-ref rfirst-defs
      :ID:       org_gcr_2017-05-12_mara:DB8DE38B-83C2-4CF9-B428-4629E4E06547
      :END:

Reading:
- [[http://stat.ethz.ch/R-manual/R-devel/library/base/html/Startup.html][Startup]] :: mandatory reading, the definitive source
- [[http://cran.r-project.org/doc/contrib/Lemon-kickstart/kr_first.html][Kickstarting R]] :: I just like this tutorial

- =attach= is a powerfuly convenient function. Sure, it can make you and your
  program go bonkers, but you know, it is worth it for the convenience. Joking
  aside, it has its place, so it should not go away completely. However, it ought
  not be used much, and if you do need to use it, the it should be really really
  obvious.
  - Eg: [fn:7ce54638: http://www.r-bloggers.com/to-attach-or-not-attach-that-is-the-question/]
#+NAME: org_gcr_2017-05-12_mara_45C9CCC7-16B0-463F-8E97-15B1680256FE
#+begin_src R
gcr$attach.unsafe <- attach
gcr$attach <- function(...) {
    warning("NEVER USE ATTACH! Use `unsafe.attach` if you must.")
    attach.unsafe(...)
}
#+end_src

- =library= reports issues immediately, and by design, =require= does not… remind
  the useR that they /may/ want the former not the latter
  - Via [fn:84031d95: http://www.r-bloggers.com/library-vs-require-in-r/]
  - Just like everything else here, this is a /personal preference/ thing!
#+NAME: org_gcr_2017-05-12_mara_F1DC88CC-9F93-41E7-8736-784E2EACF23F
#+begin_src R
gcr$require <- function(...) {
    warning("Are you sure you wanted `require` instead of `library`?")
    base::require(...)
}
#+end_src

Sometimes you only want to list everything *but* functions [fn:7b11c35d: https://stackoverflow.com/questions/13094324/hiding-function-names-from-ls-results-to-find-a-variable-name-more-quickly]:
#+NAME: org_gcr_2017-05-12_mara_86FC1743-F679-45B1-AD21-0A8A6F699225
#+begin_src R
gcr$lsnofun <- function(name = parent.frame()) {
    obj <- ls(name = name)
    obj[!sapply(obj, function(x) is.function(get(x)))]
}
#+end_src

Make it really simple to specify how to handle errors in a given session:
#+NAME: org_gcr_2017-05-12_mara_D959F4C7-DC16-4A96-9928-0A1D9B328431
#+begin_src R
gcr$recoveronerror <- function() {
    options(error=recover)
}

gcr$recoveronerroroff <- function() {
    options(error=NULL)
}
#+end_src

Make it really simple to specify how to handle warnings in a given session:
#+NAME: org_gcr_2017-05-12_mara_A1A5310B-3C47-4295-A721-70546CFE0BFB
#+begin_src R
gcr$erroronwarn <- function() {
    options(warn=2)
}

gcr$erroronwarnoff <- function() {
    options(warn=0)
}
#+end_src

=sqldf= should always use =SQLite=.

#+NAME: org_gcr_2017-05-12_mara_1E1231CF-97D0-4A23-9AE7-B78DA7F87F5D
#+begin_src R
options(sqldf.driver = "SQLite")
#+end_src

Save your fingers from having to type =head= the next =n= thousand times [fn:f9fcc455: https://stackoverflow.com/questions/13024167/how-to-make-head-be-applied-automatically-to-output] because I can't. =ess-rdired= and friends use the dataframe print function,
so I didn't make dataframes print using it.
#+NAME: org_gcr_2017-05-12_mara_C8228D0B-C98E-4732-8E04-5778886EBAB4
#+begin_src R
gcr$printdf <- function(df) {
    if (nrow(df) > 10) {
        print(head(df, 5))
        cat("---\n")
        print(tail(df, 5))
    } else {
        print(df)
    }
}
#+end_src

Sometimes you want to see all of the data in a dataframe, and sometimes you
don't. Make it really easy to change whenever you feel like it.

#+NAME: org_gcr_2017-05-12_mara_AB49EDDD-82C2-49C0-923A-75E3B3A6DD4E
#+begin_src R
gcr$printlen <- function(len=500) {
    options("max.print" = len)
}
#+end_src

When you've got =n=-thousand rows of data, make it easier to get a sample from it,
just make it specific and keep it simple.

#+NAME: org_gcr_2017-05-12_mara_2F328A8E-E928-4916-B756-6569CCD437E5
#+begin_src R
gcr$hundred <- function(df, idx=0) {
    df[idx:(idx+100),]
}
#+end_src

