R.html

<div id="outline-container-orgd2df022" class="outline-3">
<h3 id="orgd2df022"><a id="org_gcr_2017-05-12_mara:DB8DE38B-83C2-4CF9-B428-4629E4E06547"></a><span class="section-number-3">1.4</span> .First</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example">
header-args: :noweb-ref rfirst-defs
ID: org_gcr_2017-05-12_mara:DB8DE38B-83C2-4CF9-B428-4629E4E06547
</pre>

<p>
Reading:
</p>
<dl class="org-dl">
<dt><a href="http://stat.ethz.ch/R-manual/R-devel/library/base/html/Startup.html">Startup</a></dt><dd>mandatory reading, the definitive source</dd>
<dt><a href="http://cran.r-project.org/doc/contrib/Lemon-kickstart/kr_first.html">Kickstarting R</a></dt><dd>I just like this tutorial</dd>

<dt>(no term)</dt><dd><code>attach</code> is a powerfuly convenient function. Sure, it can make you and your
program go bonkers, but you know, it is worth it for the convenience. Joking
aside, it has its place, so it should not go away completely. However, it ought
not be used much, and if you do need to use it, the it should be really really
obvious.
<ul class="org-ul">
<li>Eg: <sup><a id="fnr.19" class="footref" href="#fn.19">19</a></sup></li>
</ul></dd>
</dl>
<div class="org-src-container">
<pre class="src src-R" id="org87f9533">gcr$attach.unsafe <span class="org-constant">&lt;-</span> <span class="org-constant">attach</span>
gcr$<span class="org-constant">attach</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(...) {
    <span class="org-keyword">warning</span>(<span class="org-string">"NEVER USE ATTACH! Use `unsafe.attach` if you must."</span>)
    attach.unsafe(...)
}
</pre>
</div>

<ul class="org-ul">
<li><code>library</code> reports issues immediately, and by design, <code>require</code> does not… remind
the useR that they <i>may</i> want the former not the latter
<ul class="org-ul">
<li>Via <sup><a id="fnr.20" class="footref" href="#fn.20">20</a></sup></li>
<li>Just like everything else here, this is a <i>personal preference</i> thing!</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-R" id="org39f5f6e">gcr$<span class="org-constant">require</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(...) {
    <span class="org-keyword">warning</span>(<span class="org-string">"Are you sure you wanted `require` instead of `library`?"</span>)
    base::<span class="org-constant">require</span>(...)
}
</pre>
</div>

<p>
Sometimes you only want to list everything <b>but</b> functions <sup><a id="fnr.21" class="footref" href="#fn.21">21</a></sup>:
</p>
<div class="org-src-container">
<pre class="src src-R" id="org7bf75ac">gcr$<span class="org-function-name">lsnofun</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(name = parent.frame()) {
    obj <span class="org-constant">&lt;-</span> ls(name = name)
    obj[!sapply(obj, <span class="org-keyword">function</span>(x) is.function(get(x)))]
}
</pre>
</div>

<p>
Make it really simple to specify how to handle errors in a given session:
</p>
<div class="org-src-container">
<pre class="src src-R" id="orgd28b17d">gcr$<span class="org-function-name">recoveronerror</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>() {
    options(error=recover)
}

gcr$<span class="org-function-name">recoveronerroroff</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>() {
    options(error=<span class="org-type">NULL</span>)
}
</pre>
</div>

<p>
Make it really simple to specify how to handle warnings in a given session:
</p>
<div class="org-src-container">
<pre class="src src-R" id="orgb1495a7">gcr$<span class="org-function-name">erroronwarn</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>() {
    options(warn=2)
}

gcr$<span class="org-function-name">erroronwarnoff</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>() {
    options(warn=0)
}
</pre>
</div>

<p>
<code>sqldf</code> should always use <code>SQLite</code>.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org7c25287">options(sqldf.driver = <span class="org-string">"SQLite"</span>)
</pre>
</div>

<p>
Save your fingers from having to type <code>head</code> the next <code>n</code> thousand times <sup><a id="fnr.22" class="footref" href="#fn.22">22</a></sup> because I can&rsquo;t. <code>ess-rdired</code> and friends use the dataframe print function,
so I didn&rsquo;t make dataframes print using it.
</p>
<div class="org-src-container">
<pre class="src src-R" id="orgd5ebdb7">gcr$<span class="org-function-name">printdf</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(df) {
    <span class="org-keyword">if</span> (nrow(df) &gt; 10) {
        print(head(df, 5))
        cat(<span class="org-string">"---\n"</span>)
        print(tail(df, 5))
    } <span class="org-keyword">else</span> {
        print(df)
    }
}
</pre>
</div>

<p>
Sometimes you want to see all of the data in a dataframe, and sometimes you
don&rsquo;t. Make it really easy to change whenever you feel like it.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org02954c9">gcr$<span class="org-function-name">printlen</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(len=500) {
    options(<span class="org-string">"max.print"</span> = len)
}
</pre>
</div>

<p>
When you&rsquo;ve got <code>n</code>-thousand rows of data, make it easier to get a sample from it,
just make it specific and keep it simple.
</p>

<div class="org-src-container">
<pre class="src src-R" id="org23ba6eb">gcr$<span class="org-function-name">hundred</span> <span class="org-constant">&lt;-</span> <span class="org-keyword">function</span>(df, idx=0) {
    df[idx:(idx+100),]
}
</pre>
</div>
</div>
</div>
